USE SeaTurtleOnTheWay;
GO

--會員
INSERT INTO Member.tMember
	( fAccount, fPassword, fName, fBirthdate, fMail,
	fAddress, fCity, fCeilphoneNumber, fCoins,
	fPhotoPath, fAccountTypeId, fIntroduction )
VALUES
	('root', '123456', '管理員', '2000/02/20', 'cycle2link@gmail.com', --wecanuseit
		'復興南路一段390號2樓', '台北市', 0989859112, 100000,
		'img/member/root.png', 0, '沙漠中一無所有，一無所有非人所求也。'),
	('guest', '$2b$10$7x5qvbiQNvcn43f0mjxWCO1Jx4Lc.BD0ZQkLM4dGJgQLE73WiDrBi', '訪客', '2000/02/20', 'cycle2link@gmail.com',  -- badiii7777
		'復興南路一段390號2樓', '台北市', 0989859112, 0,
		'img/member/guest.png', 5, '沙漠中一無所有，一無所有非人所求也。'),
	('romazrau', '$2b$10$vCcMCrfudRScjP8kVmqxgeo2Zz7Vd74.A7BOcAIX7ib0wMvyLRpwq', '饒孝天', '2000/02/20', 'adoro0920@gmail.com',  --55688app
		'南港區南港路2段222號2樓之2', '台北市', 0989859112, 2222,
		'img/member/id1.jpg', 2, '沙漠中一無所有，一無所有非人所求也。'),
	('AndyKao123', '$2b$10$6UI27slTilYkyOlORk6qwOoeVf/Qockdst2xMElUXTnDXnqrmCLIi', '郭安迪', '1987/08/07', 'O222132435@gmail.com',  --j123456789
		'南投縣魚池鄉富錦路33-1號', '南投縣', 0934999444, 2567,
		'img/member/id35.jpg', 2, '幻想拯救世界的積極環保人士一枚'),
	('Wwill', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '王威比', '1988/02/19', 'adoro0920@gmail.com',  -- w134667
		'中山區民生東路二段78號3樓', '台北市', 0913345168, 3700,
		'img/member/id3.jpg', 1, '佛系環保人士，盡量隨身攜帶環保餐具，偶爾還是會不爭氣地拿塑膠吸管，淨灘其實蠻好玩的，大家都是有趣的人～'),
	('JL1992', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '劉日', '1992/01/29', 'adoro0920@gmail.com',   --web123456
		'板橋區中山路二段87號', '新北市', 0921021027, 3600,
		'img/member/id4.jpeg', 2, '安安你好'),
	('aaa123', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '陳佑銘', '1993/09/06', 'A122465898@gmail.com',
		'台北市大安區和平東路二段106號11樓', '台北市', 0926324123, 6666,
		'img/member/andy.jpg', 1, '這個會員沒有留下什麼'),
	('ddd555', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'mushroom', '2012/04/01', 'A123456789@gmail.com',
		'台北市中山區林森北路372號2樓', '台北市', 0987948787, 1200,
		'img/member/id34.png', 1, '你好 我是跳級生'),
	('monokuma', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '黑白熊', '1989/06/15', 'monokuma@gmail.com',
		'新北市板橋區新站路28號', '台北市', 0963125487, 1200,
		'img/member/id5.png', 1, '讓大家都絕望吧!!!'),
	('intensecattw', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '過激貓', '1990/08/20', 'intensecattw@gmail.com',
		'台中市大雅區永和路124-5號', '台中市', 0958714895, 1200,
		'img/member/id6.png', 1, '過激就是一切'),
	('Makoto161', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '苗木誠', '1992/02/05', 'Makoto161@gmail.com',
		'桃園市桃園區長沙街', '桃園市', 0932888168, 1200,
		'img/member/id7.png', 1, '超高校級的「希望」'),
	('Kirigiri917', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '霧切', '1993/03/07', 'Kirigiri917@gmail.com',
		'新北市中和區中山路三段122號', '新北市', 0977123587, 1200,
		'img/member/id8.png', 1, '超高校級的「偵探」'),
	('Nanami314', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '七海', '1991/03/14', 'Nanami314@gmail.com',
		'宜蘭縣宜蘭市縣政北路2號', '宜蘭縣', 0912555369, 1200,
		'img/member/id9.png', 1, '超高校級的「遊戲玩家」'),
	('ufo999', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '林邁克', '1963/11/08', 'ufo999@hotmail.com',
		'台中市西屯區文華路60號', '台中市', 0966956132, 166,
		'img/member/id39.png', 1, '地方角頭'),
	('D0922343434', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '蘇菲', '2002/09/03', 'D0922343434@gmail.com',
		'台中市北屯區四平路236號', '台中市', 0922343434, 50,
		'img/member/id2.jpg', 1, '熱愛棒球，家旁邊就是棒球場'),
	('light5964', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '熊貓', '1998/02/20', 'light5964@gmail.com',
		'高雄市新興區南台路73巷1號', '高雄市', 0912456897, 100000,
		'img/member/id36.png', 2, '土生土長高雄人'),
	('sasd1348t', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '柯林頓', '1983/01/02', 'sasd1348t@gmail.com',
		'高雄市三民區力行路67-39', '高雄市', 0933565789, 1450,
		'img/member/id38.png', 1, '邊緣人'),
	('soopaaa111', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Soopaaa', '2000/02/20', 'soopaaa111@gmail.com',
		'高雄市前鎮區草衙中街46巷15-1', '高雄市', 0978159666, 870,
		'img/member/id37.png', 2, '手搖飲愛好者'),
	('Daenerys333', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Daenerys', '1985/05/12', 'Daenerys1985@gmail.com',
		'中正區中華路二段307巷', '台北市', 0985635214, 4589,
		'img/member/id10.jpg', 2, '丹妮莉絲·坦格利安（Daenerys Targaryen）是喬治·R·R·馬丁（George R. R. Martin）的《冰與火之歌》系列小說中的虛構人物，以及英國女演員艾米莉亞·克拉克（Emilia Clarke）飾演的電視改編劇《權力遊戲》。'
		),
	('Tyrion333', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Tyrion', '1987/05/23', 'Tyrion1985@gmail.com',
		'大安區師大路39巷', '台北市', 0985635214, 209,
		'img/member/id11.jpg', 2, '提利昂·蘭尼斯特（Tyrion Lannister）的暱稱是Halfman或Imp，後來又改名為Hugor Hill，是美國作家喬治·R·R·馬丁（George RR Martin）的《冰與火之歌》（A Song of Ice and Fire）系列小說中的虛構人物。'
		),
	('Cersei333', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Cersei', '1968/11/23', 'Cersei1968@gmail.com',
		'大安區羅斯福路四段1號', '台北市', 0985625414, 22245,
		'img/member/id12.png', 2, '瑟曦·蘭尼斯特（Cersei Lannister）是美國作家喬治·R·R·馬丁（George R. R. Martin）創作的《冰與火之歌》系列奇幻小說中的虛構人物，其電視改編版《權力遊戲》由英國女演員琳娜·海莉（Lena Headey）飾演。'
		),
	('Arya333', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Arya', '1992/04/23', 'Arya1992@gmail.com',
		'松山區南京東路四段2號', '台北市', 0912525414, 1225,
		'img/member/id13.jpg', 2, '艾麗婭·史塔克（Arya Stark）是美國作家喬治·R·R·馬丁（George R. R. Martin）的《冰與火之歌》史詩般的奇幻小說系列中的虛構人物。'
		),
	('Jaime333', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Jaime', '1969/12/23', 'Jaime1969@gmail.com',
		'大安區臨江街40巷1弄', '台北市', 0985652525, 300,
		'img/member/id14.jpg', 2, '詹姆·蘭尼斯特（Jaime Lannister）是美國作家喬治·R·R·馬丁（George R. R. Martin）創作的《冰與火之歌》系列奇幻小說中的虛構角色，其電視改編本是《權力遊戲》。'
		),
	('lijingchan222', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '李進陳', '2001/02/22', 'lijingchan222@gmail.com',
		'板橋區中山路一段223號4樓', '新北市', 0987555666, 850, 'img/member/id15.jpg', 1, '板橋在地人'),
	('fancisheng565', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '梵希聖', '1998/05/15', 'fancisheng565@gmail.com',
		'信義區基隆路一段200號2樓', '台北市', 0933665156, 450, 'img/member/id16.jpg', 2, '健身達人'),
	('yl1211', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '陳韻任', '1991/12/11', 'yl1211@gmail.com',
		'蘆洲區長榮路778號', '新北市', 0936552236, 250, 'img/member/id17.jpg', 2, '聊天達人'),
	('leostar1002', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '羅折剛', '1991/10/05', 'leostar1002@gmail.com',
		'三重區集賢路175號', '新北市', 0912336885, 350, 'img/member/id18.jpg', 2, '咖啡達人'),
	('superstar0829', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '李子維', '1992/08/29', 'superstar0829@gmail.com',
		'內湖區成功路二段325號8樓', '台北市', 0933336885, 650, 'img/member/id18.jpg', 2, '超級大帥哥'),
	('daisychen', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Daisy Chen', '1998/09/26', 'daisy74@gmail.com',
		'士林區美崙街93號', '台北市', 0986468754, 2600,
		'img/member/id29.jpg', 1, '破壞性捕撈、污染及氣候變遷，對獨特海洋生態構成嚴重威脅，您願意加入海洋行列，守護這蔚藍嗎？'),
	('wadeliang', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Wade Liang', '1978/10/02', 'Wade311@gmail.com',
		'潭子區大豐路三段260號', '台中市', 0928374923, 210,
		'img/member/id30.jpg', 1, '到底哪一間的環保杯比較好用啊？'),
	('Nekohsiao', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', 'Neko', '1995/04/11', 'nekoneko@gmail.com',
		'八德區巧克力街177號', '桃園市', 0976283716, 1100,
		'img/member/id31.jpg', 1, '貓咪最可愛惹'),
	('rivalin', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '森永牛奶糖', '1977/03/02', 'sugarrrr@gmail.com',
		'礁溪鄉德陽路27號', '宜蘭縣', 0928374912, 600,
		'img/member/id32.jpg', 1, '不是在衝浪，就是在去衝浪的路上'),
	('allenchiu', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '子齊', '1973/01/11', 'chichi11@gmail.com',
		'士林區美崙街93號', '台北市', 0923412312, 170,
		'img/member/id33.jpg', 1, '新加入的小萌新，經常在士林活動～'),
	('maxbigdady', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '陳玄武', '1980/01/11', 'adoro0920@gmail.com',
		'南港區南港路三段55號三樓', '台北市', 0912597123, 770,
		'img/member/rr01.jpg', 1, '道可道，非常道。名可名，非常名。無名天地之始；有名萬物之母。故常無欲，以觀其妙；常有欲，以觀其徼。此兩者，同出而異名，同謂之玄。玄之又玄，衆妙之門。'),
	('godisgood', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '藍花崗', '1980/01/11', 'adoro0920@gmail.com',
		'南港區南港路三段55號四樓', '台北市', 0912597123, 870,
		'img/member/rr02.jpg', 1, '天地不仁，以萬物為芻狗；聖人不仁，以百姓為芻狗。天地之間，其猶橐籥乎？虛而不屈，動而愈出。多言數窮，不如守中。'),
	('haveaniceday', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '許安山', '1980/01/11', 'adoro0920@gmail.com',
		'南港區南港路三段142號五樓', '台北市', 0912597123, 970,
		'img/member/rr03.jpg', 1, '天長地久。天地所以能長且久者，以其不自生，故能長生。是以聖人後其身而身先；外其身而身存。非以其無私耶？故能成其私。'),
	('letgogogo', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '姚雲母', '1980/01/11', 'adoro0920@gmail.com',
		'南港區南港路三段142號六樓', '台北市', 0912597123, 950,
		'img/member/rr04.jpg', 1, '大道廢，有仁義；智慧出，有大偽；六親不和，有孝慈；國家昏亂，有忠臣。'),
	('taiwanno1', '$2b$10$HeKQbYpIl2VgTdCBnTOchOBEj9nUCFEsRSbX80SHqEa0XhA3Xov8W', '趙輝石', '1980/01/11', 'adoro0920@gmail.com',
		'南港區南港路三段142號七樓', '台北市', 0912597123, 700,
		'img/member/rr05.jpg', 1, '知人者智，自知者明。勝人者有力，自勝者強。知足者富。強行者有志。不失其所者久。死而不亡者壽。');




-------------------------------------------------------------------------------------------------------------------
--  社團 
INSERT INTO Community.tCommunity
	( fName, fStatusId, fDate, fInfo, fImgPath)
VALUES('愛海無距 寶島淨灘團', 1, '2020/04/16', '熱愛大海的你，享受著海洋給予的美好，戲水、浮潛、衝浪、風帆、海鮮、慢步在細軟的沙灘，每一段與海洋的記憶，都豐富著我們的生活與生命。相信愛海的你，必定希望能永遠享有這樣的美景。在海邊遊玩的同時，不只帶走自己的垃圾，並舉手之勞撿起沙灘上的垃圾。對旅客而言也許只是小小的一公斤，而對荒野與海洋來說，卻是個重要行動與監測數據。現在邀請你到海邊遊玩時，跟著荒野愛海三步驟，讓旅行更具意義！', 'img/community/08.jpg'),
	('拾荒慢跑 Lets Plogging', 2, '2020/07/23', '慢跑結合環保理念，以邊跑邊走邊撿垃圾的生活態度，穿梭大街小巷，在城市漫步的同時，讓城市保持最乾淨美麗的面貌。
	慢跑中蹲下撿瓶罐等垃圾時的深蹲動作，還能加強健核心肌群，甚至跳起來撿樹上的垃圾，也是種很好的伸展運動，歡迎大家一起來參加唷！', 'img/jogging.jpg'),
	('寶寶長大啦', 1, '2020/01/11', '明明東西還很新，快拿出來給下一個需要的寶寶', 'img/community/09.jpg'),
	('一時暴雷一時爽', 2, '2020/05/02', '一直暴雷一直爽', 'img/community/movie.jpg'),
	('流浪動物義工救援團隊', 1, '2020/07/01', '我要當流浪動物義工救援團隊需要真正以實際行動幫助流浪動物的您來參加我們行列，希望能集合大家力量以真正實際行動關懷流浪動物，我們也願意跟任何關懷流浪動物團體一起配合成長。', 'img/community/02.jpg'),
	('北區志工活動資訊交流站', 1, '2020/08/16', '這裡是一個提供所有社會大眾、服務性社團、志工團隊、志工運用單位相互交流的平台！', 'img/community/01.jpg'),
	('農業栽培交流', 1, '2020/08/16', '農業技術交流都可以彼此分享', 'img/community/plant.jpg'),
	('鳥類辨識與特性觀察探討', 1, '2020/09/20', '愛好鳥類的社團，鼓勵團員從網路互動中學習如何辨識鳥類，以及分享觀察心得。', 'img/community/birdwatch.jpg'),
	('Save the World by 2030', 1, '2020/03/30', 'The influx of life-changing technologies has and is transforming the world as we know it by the seconds. Whether it’s the latest developments in artificial intelligence or quantum computing, we’re constantly reminded the vital role technology plays in making society richer, smarter, and more efficient. However, one aspect that often goes under the radar escapes a mention here is the impact tech is having on the environment, and how - if at all - it can prevent any further damage to the planet.', 'img/community/03.jpg'),
	('Coding改變Climate Change', 1, '2020/01/01', '宅宅的逆襲,我們用Javascript為環境盡一份心力', 'img/community/04.jpeg'),
	('濕地保護聯盟', 1, '2020/02/08', '以保護台灣環境，努力於濕地與相關生態保護之工作目的。以培養國民高雅之情操與保護自然環境之觀念，並參加國內外相關組織活動。以共同保護全世界濕地與相關生態。', 'img/community/05.jpg'),
	('二手書籍拍賣', 1, '2020/08/08', '減紙護樹愛地球', 'img/community/06.jpg'),
	('福爾摩沙與他們的守護者們', 1, '2020/05/18', '我們以實際的行動參與且推動一切有關台灣原生植物的保育工作，致力於教導民眾自然保育的觀念，防止自然原生環境盜採濫墾的發生...', 'img/community/rrc01.jpg'),
	('外來種狩獵場', 2, '2020/07/01', '守護台灣原生種，加入我們獲得有關外來種的資訊，協助我們一同移除外來種。', 'img/community/rrc02.jpg'),
	('綠色生活哪有那麼難', 1, '2020/02/01', '每天一個簡單綠行動，一起在日常生活中做一點小改變，也許你會開始習慣，隨時隨地都對環境再好一點點。', 'img/community/green_lifestyle_banner01.jpg'),
    ('沒垃圾就是舒服', 2, '2020/03/01', '看到人類製造的垃圾遍布街邊、山上、河流和海洋，實在是受不了了啊啊啊！大家動起來吧！這個社團的成員主要分布在北區，但也很歡迎不同地區的朋友加入，一起還給台灣一個美好的環境吧:D', 'img/community/notrash_banner.jpg');




-- 社團成員(私密社團4,14,16)(成員編號:孝天3,威比5,日6)(access:3管理員)
INSERT INTO Community.tMemberList
	(fCommunityId,fMemberId,fJoinDate,fAccessRightId)
VALUES
	
    (1, 10, '2020/04/16', 3),
	(1, 3, '2020/04/18', 2),
	(1, 4, '2020/04/20', 2),
	(1, 8, '2020/04/16', 2),
	(1, 7, '2020/07/30', 3),
	(1, 5, '2020/06/18', 2),
	(1, 29, '2020/07/02',2),

	(2, 3, '2020/06/18', 3),
	(2, 14, '2020/07/30', 2),
	(2, 4, '2020/07/30', 2),
	(2, 13, '2020/07/30', 2),
	(2, 7, '2020/07/30', 2),
	(2, 8, '2020/07/30', 1),
	(2, 12, '2020/07/30', 1),
	

	(3, 7, '2020/07/30', 3),
	(3, 10, '2020/07/30', 2),
	(3, 22, '2020/07/30', 2),
	(3, 21, '2020/07/20', 3),
	(3, 18, '2020/07/30', 2),
	(3, 17, '2020/08/30', 1),
	(3, 3, '2020/07/30', 2),
	(3, 6, '2020/04/18', 2),
	(3, 5, '2020/06/18', 2),
	----私密4----
	(4, 7, '2020/07/30', 3),
	(4, 4, '2020/07/30', 2),
	(4, 19, '2020/07/30', 2),
	(4, 26, '2020/07/30', 2),
	(4, 17, '2020/07/30', 1),
	(4, 13, '2020/07/30', 1),

	(5, 5, '2020/06/18', 2),
	(5, 3, '2020/07/30', 2),
	(5, 10, '2020/07/18', 1),
	(5, 9, '2020/07/19', 2),
	(5, 17, '2020/07/31', 2),
	(5, 23, '2020/07/15', 3),
	(5, 22, '2020/07/20', 1),
	(5, 6, '2020/04/18', 2),

	(6, 5, '2020/06/18', 2),
	(6, 3, '2020/07/30', 2),
	(6, 12, '2020/07/22', 1),
	(6, 18, '2020/07/22', 2),
	(6, 19, '2020/06/22', 3),
	(6, 13, '2020/08/14', 2),
	(6, 6, '2020/04/18', 2),

	(7, 5, '2020/06/18', 2),
	(7, 3, '2020/07/30', 2),
	(7, 20, '2020/08/02', 2),
	(7, 18, '2020/07/22', 2),
	(7, 16, '2020/07/22', 2),
	(7, 15, '2020/07/22', 2),
	(7, 14, '2020/09/18', 1),
	(7, 6, '2020/04/18', 2),

	(8, 5, '2020/06/18', 2),
	(8, 3, '2020/07/30', 2),
	(8, 6, '2020/07/22', 2),
	(8, 10, '2020/07/22', 2),
	(8, 13, '2020/07/22', 2),
	(8, 18, '2020/07/22', 2),
	(8, 22, '2020/07/22', 2),
	(8, 23, '2020/09/15', 1),

	(9, 3, '2020/07/30', 2),
	(9, 12,'2020/02/20',1),
	(9, 13,'2020/02/20',1),
	(9, 14,'2020/02/20',1),
	(9, 15,'2020/02/20',1),
	(9, 16,'2020/02/20',1),
	(9, 17,'2020/02/20',1),
	(9, 21, '2020/02/09', 3),
	(9, 22, '2020/09/09', 2),
	(9, 23, '2020/03/09', 2),
	(9, 10, '2020/09/01', 0),
	(9, 6, '2020/04/18', 2),

	(10, 3, '2020/07/30', 2),
	(10, 20, '2020/05/23', 3),
	(10, 22, '2020/09/09', 2),
	(10, 11, '2020/09/20', 2),
	(10, 13, '2020/09/19', 3),
	(10, 23, '2020/09/09', 2),
	(10, 21, '2020/09/09', 2),
	(10, 17, '2020/09/06', 2),
	(10, 16, '2020/04/18', 2),
	(10, 5, '2020/06/18', 2),

	(11, 3, '2020/07/30', 2),
	(11, 11, '2020/02/15', 2),
	(11, 13, '2020/02/16', 3),
	(11, 17, '2020/02/20', 2),
	(11, 19, '2020/02/23', 3),
	(11, 6, '2020/02/22', 3),
	(11, 10, '2020/02/22', 2),
	(11, 9, '2020/07/22', 1),
	(11, 8, '2020/04/18', 2),
	(11, 5, '2020/06/18', 2),
	(12, 3, '2020/07/30', 2),
	(12, 8, '2020/08/15', 3),
	(12, 9, '2020/08/18', 3),
	(12, 15, '2020/08/20', 3),
	(12, 16, '2020/08/23', 3),
	(12, 18, '2020/08/22', 3),
	(12, 6, '2020/08/22', 2),
	(12, 17, '2020/08/22', 2),
	(12, 20, '2020/08/22', 2),
	(12, 10, '2020/09/21', 1),
	(13, 13, '2020/07/22', 2),
	(13, 18, '2020/07/22', 2),
	(13, 22, '2020/07/22', 2),
	(13, 21, '2020/09/15', 1),
	(13, 12, '2020/09/20', 2),
	(13, 23, '2020/02/20', 1),
	(13, 3, '2020/05/18', 3),
	(13, 6, '2020/04/18', 2),
	(13, 5, '2020/06/18', 2),
	----私密14----
	(14, 13, '2020/07/22', 2),
	(14, 8, '2020/07/22', 2),
	(14, 22, '2020/07/22', 2),
	(14, 21, '2020/09/15', 1),
	(14, 12,'2020/09/20',2),
	(14, 23,'2020/02/20',1),
	(14, 4, '2020/05/18', 3),
	(14, 35, '2020/04/02', 2),
    (14, 31, '2020/03/01', 3),
    (14, 5, '2020/03/01', 2),

	(15, 6, '2020/04/18', 2),
	(15, 3, '2020/07/30', 2),
	(15, 30, '2020/02/01', 3),
    (15, 5, '2020/02/01', 2),
    (15, 11, '2020/02/02', 2),
    (15, 19, '2020/03/01', 2),
    (15, 25, '2020/03/02', 2),
    (15, 28, '2020/03/01', 2),
    (15, 31, '2020/04/02', 2),
    (15, 35, '2020/04/02', 2),
    (15, 34, '2020/04/02', 2),
	----私密16----
    (16, 31, '2020/03/01', 3),
	(16, 6, '2020/03/01', 2),
    (16, 5, '2020/03/01', 2),
    (16, 18, '2020/03/10', 2),
    (16, 20, '2020/03/11', 2),
    (16, 26, '2020/04/06', 2),
    (16, 27, '2020/04/15', 2),

	(6, 25, '2020/08/25', 2);



--  社團文章
INSERT INTO Community.tPost
	( fMemberId, fCommunityId, fPostTime, fContent, fImgPaths )
VALUES
	(10, 5, '2020/09/21 13:05', '有一隻路邊浪浪，在固定點已餵食一段時間，目前遭遇困境，因浪浪徘徊地點的那戶人家強烈反彈，周遭只有他一戶人家，
	認為我們常餵食造成狗狗在他家徘徊造成他們不便，浪浪年紀偏大，餵食了兩三年還不讓人摸祂，目前不知道該怎麼辦？家裡不方便養狗，想幫浪浪移地點浪浪又不給碰，也不知道新地點牠喜不喜歡，地點在台南善化，不知道有沒有人可以收留牠或幫忙移到新地點讓牠可以有遮風避雨的地方，我們可以繼續提供糧食飼料看醫生的錢都沒關係，謝謝', 'img/community_article/浪1.jpg'),
	(9, 5, '2020/09/08 16:23', '在安南區頂安街 看到這隻混種梗犬（像雪納瑞）在路上迷航，好幾度差點被車撞，靠近看眼睛似乎已退化看不清楚，身上穿了兩件衣服 一件掉了一半拖在身上。  當下載著小孩幫不上他什麼忙，後來他轉進巷內了', 'img/community_article/01.jpg'),
	(12, 6, '2020/09/11 12:15', '台北市政府水利工程處第四期生態志工開始招募囉！凡是對水文、自然生態、環境保育、導覽解說、棲地維護有興趣的朋友，歡迎大家的加入唷！', 'img/community_article/02.jpg'),
	(13, 6, '2020/09/13 08:20', '【第十二屆全國健康日 一日乖孫志工大募集！】缺服務學習時數和志工服務證明書嗎？希望有更多社區服務經驗，充實暑期生活？熱心公益，想為國人健康貢獻一己之力？現正招募「一日乖孫志工」，協助民眾量測腰圍及血壓！第十二屆「全國健康日」於全台 7-ELEVEN 千禧血壓站門市 舉辦免費代謝症候群健檢活動當志工服務之餘還能回去應用活動所學，關心家人的健康！【來當志工可以...】拿到志工服務證明書！(服務時數 6 或 8 小時)免費線上教育訓練，學習如何量測和認識健康標準值！可以實際接觸社區民眾，練習如何從事健康服務，經驗難得！特別歡迎高中職及大專院校學生報名參加！', 'img/community_article/6_01.png'),
	(12, 6, '2020/08/02 10:54', '[愛無國界，心手相連 -- 空中志工訓練會]在路上看到身心障礙者，因為不知道該不該協助而猶豫不前。你有過這樣的經驗嗎？身心障礙類別十分多元，在未詢問與不了解身心障礙者的狀況下，冒昧的協助反而容易使他們受傷或不知所措。那我們要如何知道身心障礙者需不需要協助，以及要如何提供協助呢？現在有機會，能讓我們更了解他們的需求！邀請您，報名參與伊甸與馬來西亞雙福殘障自強發展協會合辦的空中志工訓練會，透過講師分享、障礙體驗活動來認識不同障別，培養更正面的服務心態。時間：8 月 22 日、23 日 09:00-17:30願我們都用更體貼的方式，實踐助人的意願！', 'img/community_article/03.jpg'),
	(14, 2, '2020/07/31 07:05', '[揪團]參加國家地理頻道世界地球日賽事,挑戰組，歡迎設有一同報名', 'img/community_article/賽1.jpg,,img/community_article/賽2.jpg'),
	(6, 3, '2020/08/08 22:58', '可以請教一下嗎?真的不知道要怎麼教育我的寶貝他已經沒有爸爸的事實。孩子兩歲多而已，而他也似乎漸漸習慣沒有父親這東西。 自從6月，那個人渣因為所做的那些違背婚姻違背道德的事件被一一揭發，他索性選擇逃走不面對，後來逃回澎湖過他想要的逍遙的日子', 'img/community_article/bao1.jpg'),
	(4, 5, '2020/09/19 10:23', '[送養] 可愛小黑喵,因為目還在救更小的貓兩隻、準備結紮的母貓一隻，空間有限，希望有緣人收狀態 穩定的黑輪、米血 有興趣可以找我看更多照片', 'img/community_article/黑貓1.jpg,,img/community_article/黑貓2.jpeg'),
	(8, 5, '2020/08/28 14:02', '[認養]昨天被棄養在宮廟的小幼,40天大的小男生 沉穩乖巧 神明看顧著的孩子 預計20天後打第一劑預防針,開放認養','img/community_article/幼1.jpg,,img/community_article/幼2.jpg,,img/community_article/幼3.jpg' ),
	(7, 4, '2020/08/21 23:13', '館長開直播身中兩槍，救護車來了補充說明 好像是上次騷擾他那個館長說 這次如果不幸救不回來請大家繼續弘揚他的精神', 'img/community_article/館1.jpg,,img/community_article/館2.jpg'),
	(18, 9, '2020/07/08 08:13', '[Covid19武漢肺炎]超過四百萬人確診的2019新型冠狀病毒/武漢肺炎(2019-nCoV)仍壟罩全球，感謝台灣政府與民眾共同防疫有成，至今已經超過一個月無本土病例，令人振奮。而立法院在5/8通過了追加1500億紓困振興特別預算，台灣已經從防疫、紓困慢慢走向振興階段。在台灣諸多關注「綠色紓困」的公民團體聲明下，立法院在1500億的紓困預算增加了排除條款，這筆納稅人的救急錢不補助知法犯法的新增建違章工廠，並要求經濟部應會同相關機關，建立完整查核機制，確保工廠紓困僅提供給合法工廠以及既有未登記工廠。雖然團體希望讓既存的未登記工廠於納管後再行紓困，遺憾未能通過決議；不過，這仍是謹守法律界線的第一步，也是綠色紓困第一階段的重要概念——零傷害原則。', 'img/community_article/05.jpg'),
	(18, 2, '2020/08/08 09:30', '綠色保育_聆賞黃嘴角鴞的嘹亮夜鳴!都市人要接受保育觀念相對容易，但生活在山野、依靠農業維生的西寶居民，卻是站在保育與生計衝突的第一線。「以前，蔬果要碩大又沒蟲咬才賣得掉。田地有蟲、有草，代表農民不認真。」張榮城回憶做慣行耕作的期間，多位農友為了讓作物長得又大又美，在長期噴灑農藥後英年早逝。而野生動物對農作造成威脅，擅於捕獵的太魯閣族人便設下陷阱，以絕後患。', 'img/community_article/06.jpg'),
	(18, 2, '2020/08/15 14:22', '[照片分享]活動美照', 'img/community_article/07.jpg'),
	(19, 2, '2020/06/29 11:22', '隨著網絡的發展、大數據時代的來臨，獲取資料、整理資料，甚至到資料驅動決策已經是企業不可或缺的基礎競爭能力了。而在2020年CIO加值型策略採用中，與數據相關的決策佔了超過一半，透過資料獲取商業價值，帶來的效益遠超過我們想像，所以說資料是新的石油不容置疑。', 'img/community_article/08.jpg'),
	(19, 2, '2020/07/16 07:34', '[新聞]IT救地球！這款程式碼能守護「亞馬遜」 工程機械一進森林就關機,還記得去年亞馬遜發生大火多日，也讓全球的人意識到大自然的脆弱，那麼有沒有什麼方法能夠阻止天災呢？也許，靠著科技，我們能夠獲得一點解答。
               當時亞馬遜、印尼飽受野火之苦，但現在還是有不少森林仍持續被砍伐破壞，現在全球就有三分之一的森林面臨消失的危機。這些森林的消失或破壞生態系平衡，讓全球暖化的情況加劇，更影響人類的糧食生產、經濟發展等。
               那該如何保護森林？如果那些破壞森林的器具停擺，森林就不會遭到大規模的破壞了，對吧？所以，知名的數位行銷代理商AKQA就與多個非政府組織(NGO)合作，開發了一款名為「Code of Conscience」的軟體，只要工程機械安裝了這個軟體，進到自然保護區時，就會自動停擺、無法運作，讓森林免於被破壞的危機。
               據AKQA的描述，Code of Conscience會自動抓取聯合國裡的有關自然保護區的相關資訊，同時結合工程機具內的GPS定位系統，一旦這些機具進入自然保護區，Code of Conscience就會阻止機具運作。
               另外，AKQA與NGO也開發一款內建Code of Conscience的晶片，讓款式老舊、沒有GPS定位系統的工程機具也可以在進入森林後「自動關機」。他們將嵌有該晶片的木造玩偶送給全球前十大工程機去製造商的CEO，期盼他們能在機具中植入Code of Conscience。Native Brazilian領導人Chief Raoni Metuktire表示，由衷希望全球工程機具製造商都能夠加入保護森林的行動。
               AKQA表示，森林砍伐已經是全球性議題，而藉由Code of Conscience讓重機械製造商能變成解決問題方案的其中一環。另外，這在經濟上也是可行的，雖然Code of Conscience會讓這些產商少掉一些訂單，但全球環境保護意識持續高漲，植入Code of Conscience的製造商將會引來更多組織的支持。
               目前AKQA已跟多個NGO成功開發出Code of Conscience，他們之後的目標，是希望通過國家立法，要求工程機具都裝有Code of Conscience，藉此剝奪工程機具破壞森林的能力，保護全球環境。', 'img/community_article/09.jpg'),
	(15, 12, '2020/08/09 11:11', '愈多倒下的樹木，代表有更多的二氧化碳無法被吸收，當大氣中存在的二氧化碳濃度愈高，熱能便無法向外排出，最直接的影響就是導致全球暖化、冰川融解、海平面上升，導致可愛的北極熊無家可歸。「無紙化」不僅僅是口號，更是能夠有效減緩地球暖化的積極作法之一。', 'img/community_article/08.jpg'),
	(16, 12, '2020/08/31 14:22', '活動照片回顧', 'img/community_article/11.jpg'),
	(8, 11, '2020/02/16 09:30', '棲地的經營，需大量的義工與我們共同打造美麗的濕地樂園，無論是棲地營造與維護、野外調查、文宣美編、解說導覽等工作，不分年齡、不分男女、不分國籍，只要您有興趣與我們共同為濕地環境而努力，都歡迎您的加入！', 'img/community_article/12.jpg'),
	(5, 11, '2020/02/20 16:22', '為保育面臨生存危機的台灣原生蛙，國立清華大學生命科學系教授李家維推動台灣原生蛙保種計畫，得到清大校友總會理事長蔡進步贊助，設立國內大學第一所蛙房，目前第一期蛙房已落成，第二期正建置中，盼成為保育台灣原生蛙的中繼站，目標孕育出蝌蚪回歸自然。', 'img/community_article/13.jpg'),
	(7, 11, '2020/02/18 17:52', '台灣稀有迷鳥彩鹮在今年4月被鳥友發現有築巢的情形，近日更發現幼鳥出現在屏東崁頂油車庄野外，是台灣首度發現幼鳥，而族群數量更從17隻增加到20隻，拍鳥俱樂部會長黃蜀婷說，彩鹮可能已適應了台灣的自然環境，會不會成為留鳥值得觀察。', 'img/community_article/14.jpg'),	
	(3, 13, '2020/05/20 14:22', '水柳，小喬木；幼枝略有短柔毛。葉卵狀披針形，長6～9㎝，平滑，細鋸齒緣，先端銳形，基部圓鈍，背面略粉白。雄花穗長4～8㎝；雄蕊3～6，花絲平滑；雌花穗長3～6㎝，有梗，具苞葉；有柄，平滑。果序長7～12㎝，蒴果紡綞形。 柳絮是楊柳類之蒴果開裂後帶種絮隨風飛揚之種子，古人常以絮作花，故有「楊花」之說法。所謂的「春城無處不飛花」與「楊花水性」的名詞，都是在說的這種植物本種之枝條常上舉開展，風緻與垂柳有別，但栽植容易，耐水濕，可為低海拔水邊之綠化樹種。', 'img/community_article/rrp01.jpg,,img/community_article/rrp001.jpg,,img/community_article/rrp0001.jpg'),
	(3, 13, '2020/06/11 14:00', '台東蘇鐵，樹高1至4.5公尺，莖為柱狀，單一少有分枝，主幹粗大密被有葉柄殘留之木質基部（葉痕）。葉為羽狀複葉，長約2米，叢生於莖頂，小葉線形，水平排列，中位小葉長約26厘米，葉緣扁平不反捲，葉背無絨毛。雌雄異株，花單性，雄毬花（小胞子囊穗）長圓柱形，由多數三角尖頭狀小胞子葉所組成，狀似毬果；雌毬花（大胞子葉）扁平，裂片細長紅色，胚珠著生於兩側。種子核果狀，倒卵形或長橢圓形，紅紫色。', 'img/community_article/rrp02.jpg,,img/community_article/rrp002.jpg'),
	(3, 13, '2020/06/18 17:00', '桃實百日青（學名：Podocarpus nakaii）又稱為山相思樹、埔里百日青、土杉。為羅漢松科羅漢松屬的常綠喬木，為台灣的特有種。因生育地遭破壞及族群遭挖採，數量持續下降，生存備受威脅。經評估列屬「瀕臨絕滅」級稀有植物。', 'img/community_article/rrp03.jpg,,img/community_article/rrp003.jpg'),
	(3, 13, '2020/06/02 15:00', '烏心石又名台灣含笑（學名：Michelia compressa(Maxim.) Sargent），會有烏心石的稱呼是因為本種的木材有心材顏色較深、且質地堅硬的特性。烏心石為常綠大喬木，其樹高最高可達20公尺，樹幹直徑亦可達1公尺。烏心石廣泛分部於台灣全島中低海拔(約2200公尺以下)闊葉林，於日本、琉球亦有分布。由於其有樹冠濃密、生存能力及抗病蟲害能力強的特性，也是一種不錯的庭園樹、行道樹與造林樹種。', 'img/community_article/rrp04.jpg,,img/community_article/rrp04.jpg'),
	(3, 13, '2020/07/20 12:00', '台灣扁柏（學名：Chamaecyparis obtusa var. formosana、泰雅語/pot/、台語/kāu-khak-å/厚殼仔）又稱黃檜、台灣黃檜、松梧，是柏科扁柏屬大喬木。幹皮灰紅色，縱淺裂，長片條狀剝落，有時具方形鱗片；外皮纖維質，斷面深紅褐色；新生周皮略顯著，紫紅色；內皮纖維質，淡紅色，刀削後漸變為淡橘黃色。幹皮富含樹脂、易燃。', 'img/community_article/rrp05.jpg,,img/community_article/rrp005.jpg,,img/community_article/rrp005.jpg'),
	(30, 15, '2020/09/20 09:06', '總算買到一個不錯的環保杯，今天是第一天自己打蔬果汁當早餐，這樣就可以睡久一點了XD', 'img/community_article/green_post01.jpg'),
    (05, 15, '2020/09/04 17:10', '可惡今天要加班，好想要買鹽酥雞吃，但我忘記帶食物袋出門了啊啊啊', null),
    (05, 15, '2020/09/03 20:33', '去逛環境友善市場，這間老闆超好聊，有機蔬菜眉角好多，我只好用新台幣來支持了。', 'img/community_article/green_post02.jpg'),
    (11, 15, '2020/09/03 08:33', '買了超級可愛的食物袋，馬上拿來裝早餐～覺得早餐看起來變好吃了<3', 'img/community_article/green_post03.jpg'),
    (30, 15, '2020/09/02 21:22', '9/29的時候我們有辦一個愛護地球手作環保套組的活動～目前還有名額，這樣就不用再買環保袋或飲料袋了！@XXX就是在說你※活動連結', null), 
    (11, 15, '2020/09/02 13:03', '原本的環保袋破掉了啦，選擇障礙爆發惹，大家覺得哪個顏色比較好看？', 'img/community_article/green_post04.jpg'),
	(10, 1, '2020/09/22 13:03', '【20200913淨灘日常】<br>今天仍然是給力的小幫手團！！！各個活潑熱情又給力，實在優秀~<br>藝工隊多招募到一個優秀的警察，覺得藝工隊的職業越來越多元了<br>
今天繼續挑戰很美的奎壁山沙灘，垃圾量仍有不少，15個人排出人龍，把大量的垃圾傳上山坡，一路搬到天黑，實在累人，希望別嚇到第一次來參加淨灘的夥伴<br>最後，預告一下！ 9/20（日）第六屆淨灘野餐！！！<br>
趕快點開你的行事曆記下，美美的海景等你來唷！', 'img/community_article/1_01_1.jpg,,img/community_article/1_01_2.jpg,,img/community_article/1_01_3.jpg,,img/community_article/1_01_4.jpg,,img/community_article/1_01_5.jpg'),
(7, 1, '2020/09/02 11:12', '9/18。揪團揪團。有沒有人要一起來去東嶼坪一日遊啊？一起踏青一起爬山一起看藍色珊瑚礁。當然還會有海邊野餐活動！<br>
行程安排<br>
08：10 集合<br>
08：30 開船<br>
08：30～09：50 出發前往東嶼坪<br>
09：50～10：30 洗手間 遊客中心行程講解及宣傳影片欣賞<br>
10：30～11：30 東嶼坪秘境探索(山上)<br>
11：30～12：00 撿拾東嶼坪海漂物(淨灘)<br>
12：00～13：00 享用精緻手作午餐<br>
13：00～13：30 休息<br>
13：30～14：00 浮潛及SUP行前說明<br>
14：00～15：00 潛進東嶼坪(海洋)<br>
15：00～15：40 下午茶時間<br>
15：40～16：40 潮間帶<br>
16：40～17：40 返航至馬公港<br>
想參加的請私我', 'img/community_article/1_02_1.jpg,,img/community_article/1_02_2.jpg,,img/community_article/1_02_3.jpg,,img/community_article/1_02_4.jpg,,img/community_article/1_02_5.jpg'),
(3, 1, '2020/09/19 08:22', '別忘了，9/29、10/15都有海灘手作物的淨灘活動喔～～<br>
如果大家有超過1000的海龜積分，歡迎找我來領取！<br>
請大家告訴大家！！！當天下午14：00遊客中心集合喔！', 'img/community_article/1_03.jpg'),
(10, 1, '2020/09/20 14:30', '棉薄之力也能創造改變<br>淨灘有用，是因為我相信所謂的「上游效應」。淨灘是因為要在塑膠垃圾進入下水道、河流造成阻塞，或是在進入大海後分解成小碎片，被魚類、海鳥、海龜吃掉之前「捕捉」，越早收集這些塑膠垃圾，負面的影響就會越小。<br>
同時，對於參與淨灘工作的義工來說，海灘塑膠垃圾量之大所帶來的震撼，使其意識到垃圾問題的嚴重性，本身就很有教育意義。NGO 工作者應該很清楚，教育意義轉換成環境意識，參與者決定在行動上有所改變、減少塑膠使用、不再亂丟垃圾，這活動的成效有時甚至大於實質意義。', 'img/community_article/1_04_01.jpeg,,img/community_article/1_04_02.jpg,,img/community_article/1_04_03.jpg,,img/community_article/1_04_04.jpg,,img/community_article/1_04_05.jpg'),
(3, 1, '2020/09/17 07:44', '歡迎大家一同報名響應愛海小旅行！<br>在海邊遊玩，不只帶走自己的垃圾，讓我們順手撿起沙灘上的垃圾！<br>“淨灘”可以是一場光鮮亮麗的形象活動、一天飆汗過癮的工作假期、一堂深刻體驗的教育課程；甚至是一個啟發環境意識、重整生活態度的全新契機。<br>“淨灘”不是停止垃圾汙染的終點，卻是每個人親海、愛海與守護海洋的最佳起點。<br>“淨灘”不只是公益，更是我們再做一點有意義的事，創造共同的回憶。<br>大海的事就是我們的事，行動就是改變，改變由你我開始。
', 'img/community_article/1_05_1.jpg,,img/community_article/1_05_2.jpg,,img/community_article/1_05_3.jpg,,img/community_article/1_05_4.jpg,,img/community_article/1_05_5.jpg,,img/community_article/1_05_6.jpg,,img/community_article/1_05_7.jpg,,img/community_article/1_05_8.jpg,,img/community_article/1_05_9.jpg,,img/community_article/1_05_10.jpg'),
(5, 1, '2020/09/18 20:03', '兄弟姐妹們，認識你們真好，愛你們喔', 'img/community_article/1_06_1.jpg,,img/community_article/1_06_2.jpg,,img/community_article/1_06_3.jpg'),
(3, 1, '2020/09/16 09:44', '不管淨山淨溪淨灘淨任何東西，看到深埋地底的東西一定要小心謹慎！這次幹了蠢事，還好只是小傷！<br>請大家切記一定要用挖的！！硬拉風險太大！', null),
(3, 1, '2020/09/15 15:10', '最近熱衷潛水的人不少，提醒別擦防曬油下水 讓珊瑚白化了喔QQ', 'img/community_article/1_07.jpg'),
(5, 1, '2020/09/14 16:22', '感覺很不賴～期待未來更多無塑產品問世！', 'img/community_article/1_08_1.jpg,,img/community_article/1_08_2.jpg,,img/community_article/1_08_3.jpg,,img/community_article/1_08_4.jpg,,img/community_article/1_08_5.jpg,,img/community_article/1_08_6.jpg'),
(7, 1, '2020/09/15 18:32', '吃早餐的時候，少用了一次塑膠袋⋯一年下來就有365個塑膠袋，10個人就有3650個塑膠袋，100個人就有36500個塑膠袋⋯<br>不要小看每一小份微小的動作，集合起來都是強大的力量！減塑不難，由自身做起喔！如果你也願意，留言跟我們分享吧！', 'img/community_article/1_09.jpg'),
(29, 1, '2020/09/17 08:22', '我們結束囉！謝謝前來的新朋友舊朋友～後續再發此次淨灘的分享文喔！', 'img/community_article/1_10_1.jpg,,img/community_article/1_10_2.jpg,,img/community_article/1_10_3.jpg,,img/community_article/1_10_4.jpg,,img/community_article/1_10_5.jpg,,img/community_article/1_10_6.jpg,,img/community_article/1_10_7.jpg,,img/community_article/1_10_8.jpg,,img/community_article/1_10_9.jpg,,img/community_article/1_10_10.jpg'),

(18, 3, '2020/08/30 15:32', '一堆「女」寶寶衣服褲子，有些粗穿、有些穿沒兩次⋯<br>實在太多，無法細拍。<br>直接分尺碼五件一組。（70、80）<br>（福袋概念）<br>還有圍兜五件一組。', 'img/community_article/3_02_1.jpg,,img/community_article/3_02_2.jpg'),
(17, 3, '2020/09/13 08:22', '六月份寶寶要出生了～<br>
對於寶寶衣服收納還是沒有頭緒⋯<br>
有沒有人可以分享你的衣櫥收納照片（有小朋友的佳）<br>
我挑一名贈送7-11中杯熱美式，先謝謝大家了', 'img/community_article/3_03_1.jpg,,img/community_article/3_03_2.jpg,,img/community_article/3_03_3.jpg'),

(26, 4, '2020/08/29 18:12', '奧斯卡獲獎短片《口吃》，這個世界對有缺陷的人，充滿了敵意。好在短片結局給了一點希望，願現實一樣美好', 'img/community_article/4_02_1.jpg,,img/community_article/4_02_2.jpg'),
(13, 4, '2020/08/22 05:32', '韓國高分愛情電影！低智小混混愛上腦癱女， 兩個邊緣人的愛情故事，世間還有真情在！電影 《綠洲》', 'img/community_article/4_03_1.jpg,,img/community_article/4_03_2.jpg'),

(26, 4, '2020/08/29 18:12', '奧斯卡獲獎短片《口吃》，這個世界對有缺陷的人，充滿了敵意。好在短片結局給了一點希望，願現實一樣美好', 'img/community_article/4_02_1.jpg,,img/community_article/4_02_2.jpg'),
(13, 4, '2020/08/22 05:32', '韓國高分愛情電影！低智小混混愛上腦癱女， 兩個邊緣人的愛情故事，世間還有真情在！電影 《綠洲》', 'img/community_article/4_03_1.jpg,,img/community_article/4_03_2.jpg'),

(15, 7, '2020/09/21 08:42', '9-12月適合播種的蔬果：<br>1.花椰菜 2.茼蒿 3.芹菜 4.胡蘿蔔 5.草莓 6.蕃茄<br>-------------------------------------<br>歡迎參加10月份森林人講座，這次要分享自家種菜的小訣竅~<br>千萬別錯過了！', 'img/community_article/7_01_1.jpg,,img/community_article/7_01_2.jpg'),
(16, 7, '2020/07/22 07:32', '當超市買不到菜的時候<br>家裡的菜……值千金…<br>當超市買不到肉品的時候<br>一隻活雞……值千金<br>當我們花了很多錢買保險時<br>不妨也花點錢，買些生存常識或生存技能……', 'img/community_article/7_02_1.jpg,,img/community_article/7_02_2.jpg'),

(22, 8, '2020/09/22 17:41', '今天早上7:30分在新北市中和區板南路上的馬路中間，拾獲一隻鳥類，不知道該如何處理？請問有人可以幫忙救援嗎？感恩', 'img/community_article/8_01_1.jpg,,img/community_article/8_01_2.jpg'),
(23, 8, '2020/08/12 07:32', '1、鳥類照片：圖上。<br>
2、拾獲縣市：嘉義水上。<br>
3、拾獲日期時間：8/12。<br>
4、環境地點：家中。<br>
5、傷病情況：左翅有血。<br>
6、情況更新：通知嘉義相關救傷單位，已接走治療。', 'img/community_article/8_02_1.jpg');


-- 社團文章喜歡
INSERT INTO Community.tLike
    (fPostId, fLikeMemberId)
VALUES
    (1, 9),
	(1, 14),
	(1, 27),
	(1, 15),
	(1, 21),
	(2, 12),
	(2, 24),
	(2, 17),
	(2, 12),
	(2, 29),
    (31, 2),
	(31, 4),
	(31, 7),
	(31, 17),
	(31, 23),
	(31, 22),
	(31, 20),
	(31, 12),
    (30, 2),
	(30, 4),
	(30, 7),
	(28, 17),
	(28, 23),
	(28, 22),
	(28, 29),
	(28, 31),
	(27, 23),
	(27, 22);

-- 社團文章回覆
INSERT INTO Community.tReply
	( fPostId, fReplyMemberId, fReplyTime, fContent )
VALUES
	(1, 15, '2020/07/30 14:54', '有朋友住那附近欸，我先問問看'),
	(1, 17, '2020/07/30 15:02', 'QQ好想要養，可是家裡也不給養'),
	(1, 27, '2020/07/30 19:07', '想要增加被動收入嗎~~https://reurl.cc/A8AzDp'),
	(2, 33, '2020/09/01 18:32', '最喜歡雪納瑞了QQ'),
	(2, 24, '2020/09/01 20:03', '已分享！'),
	(2, 22, '2020/09/02 08:41', '希望他早點找到好主人....'),
    (31, 30, '2020/08/28 14:16', '你給我等等！晚點PO活動資訊給你啦'),
	(31, 11, '2020/08/28 16:42', '是什麼活動啊？'),
    (30, 11, '2020/08/28 21:34', '好讚哦這樣就不用買袋袋ㄌ'),
    (30, 25, '2020/08/28 21:45', '我覺得你可以買獨角貓那款'),
	(30, 11, '2020/08/28 22:08', '@25我勸你不要這樣喔QQ'),
    (28, 30, '2020/08/31 07:49', '你一個人吃得完嗎....'),
	(28, 05, '2020/08/31 09:23', '沒...問...題...的....'),
    (28, 35, '2020/08/31 09:51', '太...優...秀...惹....'),
	(27, 11, '2020/08/31 18:11', '只好別買了，瘦一波啊'),
    (27, 05, '2020/08/31 19:06', '不行，我有我的堅持'),
	(27, 05, '2020/08/31 19:07', '最後我拿公司的碗去買了'),
	(27, 25, '2020/08/31 19:23', '請容我叫你一聲環保王');


---------------------------------------------------------------------------------------
--  活動
insert into Activity.tActivity
	(fActName,fCreatDate,fActivityDate,fActivityEndDate,fMemberId,fIntroduction,
	fImgPath, fActLabelId, fMaxLimit,fMinLimit,fActAttestId,fActTypeId,fActLocation, fCoordinateX, fCoordinateY,fCommunityId,fInOut)
values('2020國家地理路跑-世界地球日50週年', '2020/03/09', '2020/10/08 12:00', '2020/10/08 14:00' , 9, '(Chinese level requirement: A1 level up)
Taiwanese love singing karaoke so much. KTV in Taiwan is a night out that you won’t want to miss! Everyone should try it at least once.
Come to this workshop, you can learn sentences and popular words commonly spoken, then integrate into Taiwanese life! <br><br> Application here ：https://forms.gle/JWHYuZvY17LGvNxH9
<br>Location: 台北市大安區復興南路二段 82 號
8F., No. 82, Sec. 2, Fuxing S. Rd., Da’an Dist., Taipei City 106, Taiwan (R.O.C.)',
		'img/event5.jpg', 2, 100, 10, 1, 1, '大佳河濱公園', 25.071874, 121.5802,2,'室外'),
	--'路跑','世界地球日',null,null,null),
	('魚取漁囚 - 守護海洋行動體驗特展', '2020/03/09', '2020/10/01 12:00', '2020/10/01 14:00', 5, '美麗的海洋不只面臨到海水暖化、過度捕撈的問題，還有海上奴役的人權問題。<br>
海上人權剝削往往伴隨著非法漁捕行為，保護漁工，亦是保護海洋。<br>
唯有集結力量，才能推動更多進步的政府法規與企業政策，保護海洋生態平衡。<br>
綠色和平需要大家一同成為守護海洋永續和漁工人權的一份子，希望透過展覽，將血汗海鮮和非法漁業轉載公諸於世，因此成立了「魚取漁囚」專案計畫。',
		'img/event6.png', 3, Null, Null, 1, 1, '布袋漁港', 25.007839, 121.494713,15,'室外'),
	--'守護海洋','世界地球日',null,null,null),
	('Plogging淨街慢跑-迪化街', '2020/07/13', '2020/10/19 13:00', '2020/10/19 16:00', 8, '「在乾淨的環境中，擁有健康的身體！」這是淨街慢跑者的座右銘。<br><br>
那什麼淨街慢跑者？也就是從事淨街慢跑的運動者！<br>
淨街慢跑又是什麼？你沒有聽過嗎？別擔心，不認識淨街慢跑是很正常的事，因為這是項非常新的運動潮流。<br>
淨街慢跑運動開始於 2016 年，但直到 2018 年才成立法國淨街慢跑的 Instagram 頁面；而淨街慢跑源自位於法國北方的好鄰居：瑞典。<br><br>
淨街慢跑（Plogging）這個詞彙，是由慢跑（jogging）和 瑞典語中的撿垃圾（plocka upp）兩個單詞組合而成。因此，plogging 也就是所謂的 éco run（淨街慢跑）。<br>
進行淨街慢跑時，要隨身攜帶一個袋子（背包或垃圾袋），一邊慢跑，一邊撿沿路的垃圾。斯德哥爾摩的路上時常可以看到許多這樣的淨街慢跑者。<br>
這是一種有助於身體健康，同時能維持市容整潔的運動方式。聽起來很不錯吧？！發明這項運動的瑞典人太令人敬佩了。',
		'img/event2.jpg', 2, 80, 5, 1, 2, '迪化街', 25.133756, 121.36425,2,'室外'),
	--'守護海洋','世界地球日',null,null,null),
	('環保潛水隊-隊員招募中', '2020/04/22', '2020/10/03 10:00', '2020/10/03 14:00', 10, '為減少海洋垃圾，市府環境保護局成立海岸巡護隊清除海灘垃圾，也成立海洋環保艦隊清除海漂垃圾，唯獨海底垃圾並無清除機制，為此，環保局規劃成立「環保潛水隊」，培訓「海底清道夫」清除海底垃圾。環保局表示，已從公部門招募首批廿名隊員完成受訓，將於六月十五日「世界海洋日」成軍，當日首度下水試清理。',
		'img/event12.png', 0, 30, Null, 1, 2, '東北角 - 龍洞', 25.283227, 121.525955,6,'室外'),
	--'潛水','環保','海洋垃圾','培訓',null),
	('臉部平權運動臺北國道馬拉松', '2020/05/01', '2020/10/12 18:00', '2020/10/12 20:00', 11, '不看外表，用實力說話，一起為臉部平權而跑。<br>
感謝您支持臉部平權運動臺北國道馬拉松！我們盼望藉由這場符合運動家精神的賽事，落實臉部平權理念：「友善對待每個人，不因外貌而有差別，讓社會上的每個人都能獲得應有的尊重及公平對待」，今年我們加開 3K 賽事，歡迎您邀請親友站上國道，為所有跑者與燒傷及顏損朋友一同喝采！',
		'img/event7.jpg', 2, 50, Null, 1, 2, '中山高速公路五股 - 汐止高架段', 24.979212, 121.624832,2,'室外'),
	--'認識自己的城市',null,null,null,null),
		
	--'潛水',null,null,null,null),
	('世界環境清潔日 相約海洋淨灘', '2020/06/12', '2020/10/10 20:00', '2020/10/13 22:00', 4, '公益小旅行因付出而有意義<br>來海邊走走，也帶一點東西回去<br>重新認識這座島嶼的人、環境、海洋與藝術<br>淨灘跟你想的不一樣 Let’s Do It!',
		'img/event3.jpg', 1, 10, Null, 1, 2, '新金山海灘', 25.230442, 121.645088,1,'室外'),
	--'淨灘',null,null,null,null),
	('天母二手市集', '2020/09/07', '2020/10/15 12:00', '2020/10/15 15:00', 4, 'https://vivawei.tw/tianmu-market/',
		'img/activity/二手市集03.jpg', 4, 150, 20, 1, 2, '台北', 25.117735, 121.528873,null,'室外'),
	--,'二手市集','跳蚤市場','挖寶趣','斷捨離',null),
	('鳥兒哪裡去八里濕地野鳥觀察', '2020/08/01', '2020/10/22 16:00', '2020/10/22 20:00', 1, 'https://www.google.com',
		'img/activity/eight.gif', 3, 20, Null, 1, 1, '新北', 25.116668, 121.383476,null,'室外'),
	--,'鳥類觀察','生態觀察','踏青',null,null),
	('城市獵人-富陽生態公園夜觀', '2020/08/10', '2020/10/01 17:00', '2020/10/01 21:00', 1, 'https://www.google.com',
		'img/activity/fuyang.jpg', 3, 20, Null, 1, 1, '新北', 25.0151, 121.5593,null,'室外'),
	--'鳥類觀察','生態觀察','踏青',null,null),
	('大風吹，吹什麼? 園藝寶貝交換活動', '2020/09/10', '2020/10/23 10:00', '2020/10/23 18:00', 1, 'https://www.google.com',
		'img/activity/園藝交換.jpg', 4, Null, Null, 1, 4, '新北', 24.161435, 120.670738,null,'室外'),
	--'園藝','二手市集','花卉',null,null),
	('荒野保護協會【2020工作假期】萬里工作日', '2020/06/15', '2020/10/08 11:00', '2020/10/08 14:30', 5, 'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9075',
		'img/activity/荒野保護協會.jpg', 3, Null, 5, 1, 1, '新北', 25.178855, 121.673241,null,'室外'),
	--'荒野保護協會','環保','棲地工作',null,null),
	('【愛海無距~誰是沙害者】~ 2020國際淨灘行動', '2020/07/27', '2020/10/16 10:00', '2020/10/16 14:00', 5, 'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9568',
		'img/activity/淨灘12.jpg', 1, 60, 15, 1, 1, '新北', 24.175516, 120.475388,null,'室外'),
	--'荒野保護協會','環保','棲地工作',null,null),
	('2020筏子溪常態性淨溪', '2020/06/02', '2020/09/06 18:00', '2020/09/06 20:00', 5, 'https://www.sow.org.tw/civicrm/event/info?reset=1&id=9374',
		'img/activity/clean_river.jpg', 1, 30, Null, 1, 1, '花蓮', 24.152464, 120.621943,null,'室外'),
	--'淨溪','荒野保護協會','環保','踏青','環保行動'),
	('2020植樹', '2020/05/03', '2020/09/01 13:00', '2020/09/01 19:00' , 6, 'https://udn.com/news/story/7324/4400884',
		'img/activity/plant_tree.jpg', 3, 20, Null, 1, 1, '台中', 24.167682, 120.755196,null,'室外'),
	--'環保','城市綠洲',null,null,null),
	('PUMA環保愛地球 ', '2020/06/06', '2020/08/09 11:00', '2020/08/09 15:00', 6, 'https://www.puma-nightrun.com.tw/competition_info.php',
		'img/activity/puma.png', 4, 50, Null, 1, 1, '花蓮', 24.193377, 120.732193,null,'室外'),
	--'環保','路跑',null,null,null),
	('換換二手衣物換換愛', '2020/10/20', '2020/09/11 12:30', '2020/09/11 18:00', 2, 'https://www.google.com',
		'img/activity/clothes.jpg', 4, null, 20, 1, 1, '彰化', 24.17301, 120.665932,null,'室外'),
	--'換物','二手','交流','環保愛地球','環保小尖兵'),
	('綠的手作坊-漂流木新生命', '2020/09/07', '2020/08/31 10:00', '2020/08/31 14:00', 2, 'https://www.google.com',
		'img/activity/wood.jpg', 1, 5, Null, 1, 1, '高雄', 24.20309, 120.618896,null,'室外'),
	--'漂流木','環保','手作','環境行動','環保愛地球'),
	('偏鄉關懷，愛心捐物', '2020/05/04', '2020/08/09 15:30', '2020/08/09 18:30', 2, 'https://www.google.com',
		'img/activity/away.jpg', 4, null, Null, 1, 4, '高雄', 24.11126, 120.642929,null,'室外'),
	--'原民','捐物','愛心關懷','環保行動','環保愛地球');
	('2020 阿里山雲端路跑', '2020/08/28', '2020/10/01 05:00', '2020/10/01 08:30', 13, '一、 活動宗旨： 海拔 2000 公尺以上的高山，阿里山擁有豐富的自然與人文資源，日出、雲海、森林、鐵道以及原住民文化，阿里山更是空氣清淨品質區域，全台唯一阿里山高山路跑，邀請您一同體驗高山之美。
<br>
<br>二、 主辦單位：聯網國際資訊股份有限公司
<br>
<br>三、企業贊助：青葉油漆、明山油漆行
<br>
<br>四、 活動日期 : 109 年 9 月 20 日 (星期日)
<br>
<br>五、 活動地點 : 阿里山國家森林遊樂區外停車廣場 (中油阿里山新站旁)(台 18 線 87K 處)
<br>
<br>六、 活動路線 :
<br>
<br>(一)、 42KM 全馬組 (限時 5.5 小時)    
<br>阿里山國家森林遊樂區外停車廣場 (中油阿里山新站旁)(起點)→阿里山新中橫公路 (台 18 線往南投方向)→台 18 線約 108.5k 處 (塔塔加停車場前) 原路折返→阿里山國家森林遊樂區外停車廣場 (終點)
<br>(二)、 21KM 半馬組     
<br>阿里山國家森林遊樂區外停車廣場 (中油阿里山新站旁)(起點)→阿里山新中橫公路 (台 18 線往南投方向)→台 18 線約 97.5k 處 原路折返→阿里山國家森林遊樂區外停車廣場 (終點)
<br>(三)、 10KM 挑戰組
<br>阿里山國家森林遊樂區外停車廣場 (中油阿里山新站旁)(起點)→阿里山新中橫公路 (台 18 線 往南投方向)→台 18 線約 92k 處 原路折返→阿里山國家森林遊樂區外停車廣場 (終點)
<br>(四)、 5KM 健走組
<br>阿里山國家森林遊樂區外停車廣場 (中油阿里山新站旁)(起點)→台 18 線約 89.5k 處 (第一補給站) 原路折返→阿里山國家森林遊樂區外停車廣場 (終點)',
		'img/activity/2020阿里山路跑.jpg', 5, 50, 10, 1, 1, '阿里山國家森林遊樂區外停車廣場(中油阿里山新站旁)(台18線87K處)', 23.5112991, 120.8014838,2,'室外'),
	--'阿里山','雲端','2020','路跑',)
	('2020 停一下往山林跑系列活動', '2020/07/03', '2020/12/25 05:00', '2020/12/25 07:00', 11, 'https://www.beclass.com/rid=2343bed5ea8dd0635bd5',
		'img/activity/停一下往山林.jpg', 5, 80, 10, 2, 3, '真武山受玄宮', 24.9088265, 121.5346265,2,'室外'),
	--'停一下往山林','路跑')
	('台灣斯巴達障礙跑競賽 - TRAIL 越野跑', '2020/08/30', '2020/10/09 07:30', '2020/10/09 14:30', 10, 'https://kwankwan.kktix.cc/events/10ntcspartan-1qrq',
		'img/activity/斯巴達.jpg', 5, 100, 20, 3, 1, '新北貢寮', 25.0519184, 121.9204032,2,'室外'),
	--'路跑','斯巴達','障礙賽')
	('2020 普悠瑪鐵人三項', '2020/09/10', '2020/10/17 04:40', '2020/10/17 13:00', 9, 'https://bao-ming.com/eb/www/reg.php?activitysn=3985',
		'img/activity/普悠瑪.jpg', 5, 70, 20, 1, 1, '臺東市森林公園活水湖', 22.7652163, 121.1625769,null,'室外'),
	--'路跑','普悠瑪','鐵人三項')
	('好想出去走走。高雄 x 黃明志虛擬演唱會', '2020/05/21', '2020/11/22 20:00', '2020/11/22 22:00', 6, '黃明志的首場線上虛擬演唱會在6/2 晚上8點 正式開唱! 這是黃明志跟高雄市政府觀光局、Yahoo TV 的共同合作 透過 Yahoo TV 全新的 AR 虛擬技術，將他的歌曲結合景點 完成這場相當特別的演出 所以這不只是一場演唱會 更是特別的高雄之旅！',
		'img/activity/好想走走.jpg', 6, 3000, 5, 3, 4, '線上活動', 1, 1,null,'室內'),
	--'黃明志','虛擬演唱會','AR','好想出去走','高雄')
	('2020 Hood to Coast環保朝聖之路 - 金山淨灘健行', '2020/08/01', '2020/10/27 07:30', '2020/10/27 12:00', 10, '我們將於金山青年活動中心集合，並舉行行前講座，更加深入瞭解環境與「淨灘」的核心意義。接著，一起漫步至下寮海灘，開始協助整理海岸。達成任務後，我們將繼續朝聖之路——前往神秘海岸！一路健行、欣賞風景後回到起點，進行最後的紀念帆布袋絹印。',
		'img/activity/金山淨灘.jpg', 2, 15, 5, 1, 3, '金山青年活動中心', 25.2261073, 121.6400034,null,'室外'),
	--'淨灘','健行','金山','環保')
	('海岸環境教育淨灘活動', '2020/07/22', '2020/09/28 14:30', '2020/09/28 17:00', 13, 'https://www.beclass.com/rid=2443d6a5f30feb5a3e56',
		'img/activity/海洋環境教育淨灘.jpg', 3, 50, 5, 1, 4, '新北市淡水區六塊厝沙灘', 25.2262509, 121.572151,null,'室外'),
	--'淨灘')
	('Discovery 一件好事救海洋 - 基隆淨海', '2020/06/23', '2020/09/15 09:00', '2020/09/15 12:00', 6, 'https://www.discoverychannel.com.tw/saveocean/cleansea.html',
		'img/activity/基隆淨海.png', 2, 20, 5, 1, 4, '潮境公園', 25.1436376, 121.8009826,null,'室外'),
	--'淨海','一件好事','Discovery')
	('杉林溪 - 環教課程：穿林訪花 (擁抱大自然)', '2020/07/11', '2020/10/01 09:00', '2020/10/01 12:00', 13, '環境教育主題: 環境倫理與責任    自然保育    環境科學     資源保育     永續發展  ---------------------------------------------------------------------- 環境教育分段 能力指標 1-2-3 察覺生活周遭人文歷史與生態環境的變遷。3-1-2 能具有好奇心，體認人類在生態中的角色，以及自然環境與人的相互關係。3-2-2 培養對自然環境的熱愛與對戶外活動的興趣，建立個人對自然環境的責任感。3-4-4 願意依循環保簡樸與健康的理念於日常生活與消費行為。教學目標: 1. 認識欣賞中海拔森林步道特色動植物。2. 體認生物與花卉間的依存關係，我們人類應該如何做才能使得環境能永遠維持下去。3. 能理解並落實無痕山林的理念。',
		'img/activity/衫林溪.jpg', 3, 15, 5, 1, 3, '杉林溪森林生態渡假園區', 23.6394745, 120.7900232,null,'室外'),
	--'衫林溪','擁抱大自然')
	('陪他找家 - 貓咪照顧志工', '2020/08/03', '2020/09/01 10:00', '2020/09/30 13:00', 10, 'https://harvest365.org/events/8127',
		'img/activity/貓咪志工.jpg', 1, 20, 5, 2, 2, '咪可思關懷流浪動物協會', 25.0580828, 121.4829843,null,'室外'),
	--'貓咪照顧','關懷流浪動物')
	('愛自在銀髮俱樂部志工', '2020/06/20', '2020/09/17 10:00', '2020/09/31 16:00', 12, 'https://harvest365.org/events/8114',
		'img/activity/愛自在.jpg', 1, 30, 5, 2, 3, '臺北市中山區南京東路二段 160 號 7 樓', 25.0517348, 121.5322653,null,'室外'),
	--'銀髮族')
	('公館市集報名', '2020/08/22', '2020/10/03 17:00', '2020/10/03 22:00', 11, '公館二手市集規則價錢撇步注意事項方法一次報給第一次擺攤的你！公館多次擺攤心得經驗分享，煩惱著買太多衣服都穿不到，家裡太多物品都用不到丟掉可惜，擺攤不難只要有想賣的衣物、小物品都可以帶來，新舊都好，只要有人喜歡有人買，我是為了籌出去玩的旅費，偶爾會和阿倫到公館市集擺攤，這市集每個禮拜六日都有! 這篇教導大家如何報名、一些細節、撇步，供你們參考囉~',
		'img/activity/公館市集.jpg', 4, 30, 5, 2, 3, '公館創意跳蚤市集', 25.0148355, 121.5299176,null,'室外'),
	--'公館','跳蚤市集')
	('Enjoy癮舊衣二手市集', '2020/09/20', '2020/10/03 17:00', '2020/10/03 22:00', 10, '1. 本市集提供二手物品買賣的平台，所有交易皆須符合法令規範，若有違法請買賣雙方自行負相關責任。2. 報名的攤友們若臨時有事不克前來，請於7天前告知主辦單位，否則不予退款。3. 我們只希望有誠意的賣家來出清自己的美物，請不要拿批發的商品來販售，若被發現將列為拒絕往來戶。4. 請注意自身安全及保管好財物，以及身體狀況，有任何問題請自行負責。5. 每個攤位都有自己的主人，請勿掠過城池侵犯到別人的領地(包含公共區域)。6. 本二手市集活動若因故取消，可於公布取消後3天內來訊申請退款。 7. 請勿使用小蜜蜂叫賣8. 請勿販售無密封包裝的食物，並不得試吃9. 若遇天氣預報有颱風等情形，會視情況將活動延期10. 結束擺攤時請將垃圾清潔乾淨。11. 人行道切勿長時間停車，若遭開罰請自行負責。12. 主辦單位保有活動異動及未盡事宜補充權利。',
		'img/activity/舊衣市集.jpg', 4, 30, 5, 2, 1, '科工館南館', 22.6399149, 120.3205988,null,'室外'),
	--'舊衣')
    ('臺北市音樂季－露天音樂會<寵物音樂會>','2020/08/20','2020/09/12 19:30','2020/09/12 21:30',9,'[演出者]指揮：姜智譯 Roger Chih-I Chiang, Conductor，曼陀林：陳姵怡 Pei-I Chen, Mandolin，TSO 青年管弦樂團 TSO Youth',
	'img/activity/寵物音樂會.jpg',0,200,20,1,3,'大安森林公園露天音樂臺',25.0301381,121.5332588,null,'室外'),
	--'寵物音樂會')
	('臺北市音樂季－名家系列<聽，假新聞！>','2020/08/22','2020/10/19 19:30','2020/10/19 21:30',9,'被譽為「世紀銅管樂手」的林柏格，不只是頂尖的長號演奏家，更身兼作曲和指揮，堪稱全方位音樂家。本場音樂會，林柏格以指揮棒率領北市交，演出他融合異國風與爵士色彩的小號協奏曲，以及充滿諷刺意味的管弦樂曲《假新聞》。作曲家親自登臺「現身說法」，你聽到的，絕不是假新聞！同樣身兼多重身分的美國作曲家伯恩斯坦，以宏偉的管弦樂法，融合拉丁情調，打造了二十世紀最經典的音樂劇之一《西城故事》。劇中多首膾炙人口的旋律，以色彩繽紛的管弦樂法重新包裝，依然扣人心弦！國際當紅小號演奏家弗洛瑞斯聯袂同臺，從古典樂派到現代創作，黃金小號，風華再現！',
	'img/activity/聽假新聞.jpg',0,200,20,1,3,'中山堂中山廳',25.042847,121.5078225,null,'室外'),
	--'假新聞','名家系列')

	('埔里鯉魚潭 生態觀察活動', '2020/07/09', '2020/10/19 12:00', '2020/10/19 14:00' , 8, '埔里鯉魚潭為南投縣唯一的天然湖泊，在這個湖泊孕育了豐富的動植物生態，並經過多方的保護及復育，成果豐碩，經過調查的步道中，鯉魚潭風景區即為其中最優質的賞蝶步道。每年4月至10月的賞蝶季節，埔里鯉魚潭園區內蝶隻翩然飛舞，埔里鯉魚潭超過500種類以上的植物，蝴蝶種類135種，蜻蜓種類有50種，而留鳥種類更超過30種，而在埔里鯉魚潭常見的蝴蝶有琉璃紋鳳蝶、紅擬豹斑蝶、端紫斑蝶， 是具有潛力推動生態旅遊及蝴蝶環境教育的場域，埔里鯉魚潭、蜈蚣社區與國立暨南國際大學科技學院社會責任實踐辦公室第一次共同以產業、社區、學校推出「埔里鯉魚潭　生態導覽觀察活動」，生態導覽活動是認識自然最佳的路徑，藉由此專業生態導覽活動讓參與的民眾深度的了解，並培養保護及復育的概念，深入體驗自然，共賞大自然的恩賜。',
		'img/activity/鯉魚潭.jpg', 3, 100, null, 1, 1, '南投', 23.962056, 120.997310,null,'室外'),
	('觸口蝶蝶樂　國家森林志工帶隊賞蝶趣', '2020/08/28', '2020/10/06 09:00', '2020/10/06 18:00' , 5, '林區管理處於109年9月6日及27日(星期日)上午9時至12時在觸口自然教育中心園區辦理「觸口蝶蝶樂-親子賞蝶」活動，將由國家森林志工帶隊認識蝴蝶，並進行蝴蝶剪紙及吊飾DIY，活動免費，每場限額30人，歡迎國小以上親子家庭報名參加。',
		'img/activity/蝶.jpg', 3, 100, 20, 1, 1, '嘉義', 23.453232, 120.559205,null,'室外'),
	('校園二手物品再使用交換活動', '2020/08/10', '2020/10/10 09:00', '2020/10/10 12:00' , 9, '學校配合校慶、園遊會或辦理環保教育活動中，增加辦理二手物品再使用活動，及以學生力量結合FB等社群，展現二手物交換活動成果，讓堪用的資源重複使用，延長使用生命週期的環保理念，深入校園落實學生推動。',
		'img/activity/校園二手.jpg', 4, 100, null, 1, 1, '台北', 25.056343, 121.515735,null,'室外'),
	('新北市集交換', '2020/08/28', '2020/10/06 09:00', '2020/10/06 18:00' , 5, '以資源循環、節能減碳、關懷弱勢、教育藝文為主題，透過不同的主題活動規劃，帶給民眾不同的環保知識；並執行各站管理維護工作；擴大資源整合，增加可再使用物資種類及數量，以提高資源再使用率。同時透過網路露出相關資訊，讓愛物惜福觀念有效傳遞，激勵更多民眾共同參與，讓節能減碳行動生活化。',
		'img/activity/新北市集.jfif', 4, 100, 20, 1, 1, '新北', 23.453232, 120.559205,null,'室外'),
	('志工相揪搏趣味，年度志工大會師趣味競賽活動', '2020/08/26', '2020/09/18 09:00', '2020/09/18 12:00' , 9, '
活動目的：
1. 透過活動促進青年志工與屏東在地NPO組織交流。
2. 藉由活動凝聚志工團隊向心力，增進志工彼此間之情誼。',
		'img/activity/趣味.jpg', 1, null, 5, 1, 1, '台北', 24.131182, 120.703555,null,'室外'),
	('單親母子家園兒童暑假營隊-青年志工招募', '2020/07/19', '2020/10/01 09:00', '2020/10/01 18:00' , 3, '家園媽媽平時總為了孩子們溫飽憂愁，假日仍需忙於加班，而無法好好陪伴孩子，因此家園於每年暑假皆舉辦三天兩夜親子旅遊活動，希望能夠促進親子間關係。',
		'img/activity/母子暑期.jpeg', 1, null, 10, 1, 1, '台中', 24.105194, 120.621716,null,'室外'),
	('淨溪活動展開 環保局與水環境巡守隊齊心守護河川之美', '2020/07/24', '2020/10/01 15:00', '2020/10/01 18:00' , 2, '以實際行動守護河川及環境之美，吸引眾多民眾共襄盛舉。環保局籲請民眾愛護環境、人人有責，一起營造乾淨城市。',
		'img/activity/淨溪.jpg', 2, null, null, 1, 1, '台中', 24.096836, 120.692391,null,'室外'),
	('The North Face無痕山林體驗日新北三貂嶺步道淨山！', '2020/07/19', '2020/10/07 09:00', '2020/10/07 17:00' , 6, 'The North Face與健行筆記共同舉辦「北面無痕山林體驗日系列活動」，10/6(六)要帶大家前往台中大肚的萬里長城步道淨山。當日除了清理步道上的垃圾，更將進一步分享無痕山林七大準則概念，教你如何在親近山林的同時減少人為環境衝擊。這麼棒的活動，還不快跟我們一起出發！',
		'img/activity/新北三貂嶺步道.jpg', 2, null, null, 1, 1, '新北', 25.060448, 121.822413,null,'室外'),
	('國家地理世界海洋日路跑', '2020/05/29', '2020/10/09 07:00', '2020/10/09 18:00' , 3, '在防疫新生活的同時，守護海洋的心依舊要持續！《國家地理》雜誌冀以線上路跑活動及海洋生物、環境等介紹，喚起人們對海洋生態的保護意識。邀請熱愛海洋的朋友，發揮群眾的力量關注海洋議題，進而化為實際行動。',
		'img/activity/國家地理世界海洋日路跑.jpg
		', 6, null, null, 1, 1, '線上', 0, 0,null,'室外'),
	('[揪團]《環保運動公園》在都市裡也能森呼吸', '2020/08/19', '2020/10/04 07:00', '2020/10/07 12:00' , 10, '一起運動享受生活，愛地球',
		'img/activity/環保運動.jpg', 5, null, null, 1, 1, '嘉義', 23.695691, 120.530066,null,'室外'),
	('2020春祭路跑', '2020/08/11', '2020/09/30 07:00', '2020/09/30 12:00' , 6, '特別的日本風路跑活動🍣參加紀念衣是日式祭典服👘與日式祭典面具，暖身操還是日本廟會的祭典舞🎎不只這樣完跑還有特製的祭典獎牌🎖️、祭典面具、祭典扇，快揪團一起來享受春季祭典',
		'img/activity/春祭路跑.png', 5, null, 20, 1, 1, '台北', 25.010692, 121.506557,null,'室外'),
	('2020 ELLE RUN WITH STYLE ', '2020/07/19', '2020/10/04 07:00', '2020/10/07 12:00' , 6, '020年ELLE Run with Style，邀請你風格起跑，用你的時尚態度，征服賽道，同時，
響應環保理念，上衣採回收紗線製成；獎牌由回收五金再製，與ELLE一起mix and match，
打造你的永續時尚運動造型，讓賽道成為你的伸展台!
我們大佳河濱公園見 ！',
		'img/activity/大佳河濱elle.jpg', 5, null, null, 1, 1, '台北', 25.073906, 121.540762,null,'室外'),
	('2020年永慶盃路跑活動', '2020/07/22', '2020/10/29 10:00', '2020/10/29 16:00' , 7, '永慶盃路跑活動已邁入第十一屆，長庚紀念醫院長期致力國人健康促進及預防保 健，深諳養

                                                                   成健康飲食及規律運動習慣，才是健康促進根本之道。因此積極推動社區健康促進，並配合國健

                                                                   署及衛生局社區健康促進政策，針對社區民眾健康相關議題進行廣進而養成民眾健康行為。推動

                                                                   社區健康促進多年，各院區屢獲國健署及衛生局相關獎項，深受政府及民眾肯定。',
		'img/activity/永慶盃路跑活動.jpg', 5, null, null, 1, 1, '台中', 25.061191, 121.370606,null,'室外'),
	('環保產業與永續校園體驗營', '2020/08/20', '2020/10/01 09:00', '2020/10/01 21:00' , 7, '隨著人口成長、都市開發、經濟與工業的發展，製造了層出不窮的環境污染、生態破壞、資源耗竭等問題，甚至導致氣候變遷的全球性環境問題，人類能否永續發展？端賴於我們對環境保護的認知與努力。',
		'img/activity/校園體驗營.jpg', 0, null, null, 1, 1, '嘉義', 25.012838, 121.470457,null,'室外'),
	('替代能源具基載綠電之國際研習會議', '2020/07/27', '2020/09/27 08:00', '2020/09/27 13:30' , 7, '綠電永續新選擇',
		'img/activity/會議.jpg', 0, null, null, 1, 1, '彰化', 23.472198, 120.426243,null,'室外'),
	('偏鄉教育師資培育研習', '2020/04/04', '2020/10/19 9:00', '2020/10/19 17:00', 26, '如果可以，讓我們一同為偏鄉的孩子開創一場不一樣的學習之旅，發展屬於他們的燦爛人生！
	為期三天的「偏鄉教育師資培育研習」，為您提供一個改變的機會，只要您對偏鄉教育有一顆真摯熱情的心，歡迎與華人無國界教師學會一同為偏鄉教育加值。',
		'img/activity/education_downtown.jpg', 1, 40, 5, 0, 1, '屏東', 22.5133756, 120.5161081,null,'室內'),
	--'偏鄉教育','研習營','教育','共勉之',null),
	('寓見浪浪市集', '2020/05/11', '2020/10/30 13:00', '2020/10/30 19:00', 31, '「#三丁目的夏祭園遊會」💬浪浪市集：從「領養代替購買」出發，但我們知道這還是不夠的，
	人類還要放棄對品種的執著，更不是在挑選生命，而是讓一隻孤苦無依的浪浪，因為你，獲得新生。我們持續做這件事，因為在這世界上，沒有人是局外人。💬寓見浪浪：無法給浪浪們一個溫暖的家，
	至少給浪浪們一口溫飽的飯，「寓」見浪浪，讓你的愛不再流浪。', 'img/activity/salon_charity.jpg', 4, null, null, 1, 4, '台北', 25.0408802, 121.5445652,null,'室外'),
	--'浪浪','義賣','領養代替購買','刺青','剪髮'),
	('公益瑜珈・森森呼吸', '2020/08/21', '2020/10/03 09:00', '2020/10/03 11:00', 27, '我們是一群一起學習、練習瑜珈、受過師資培訓的朋友們，想要分享瑜伽的美好給大家。
	讓分享的善與和諧流轉起來，想要邀請大家一起來森林動一動。這半年的地球因為疫情而得到休息，人們也因此必須面對不同的工作、經濟、生活模式。讓我們一起脫離舊有的生活型態，來公園享受綠意與生態，
	給自己的心一場大休息。週末的早晨一起來公園森森呼吸吧！', 'img/activity/yoga01.jpg', 5, null, null, 1, 1, '台北', 25.0324398, 121.5327167,null,'室外'),
	--'瑜珈','公益','初學者友善','周末活動',null),
	('台北蚤之市 第七回 Taipei Flea Market 2020', '2020/09/10', '2020/10/11 11:00', '2020/10/11 18:00', 22, '台北蚤之市第七回室內古物跳蚤市場，免門票！歡迎大家來玩：）
	家中不要的舊物可能是其他人遍尋不著的寶貝，帶過來碰碰運氣吧！', 'img/activity/mkt01.jpg', 4, null, null, 1, 1, '台北', 25.0360703, 121.4977054,null,'室外'),
	--'跳蚤市集','古物','斷捨離','周末活動',null),
	('《救救海龜》大手牽小手，齊心護海洋', '2020/08/21', '2020/10/26 15:30', '2020/10/26 17:30', 29, '撿垃圾有什麼用？撿不乾淨為何還要繼續撿？台灣的淨灘行動從15年前至今已經很普遍，淨灘不僅達到了撿垃圾的目的，更重要的是對於環境教育以及政策遊說的力量。從「台灣清淨海洋行動聯盟」到「台灣海洋廢棄物治理平台」，促成了台灣減塑政策。
	<h6 style="font-weight:bold;">垃圾，海濱的日常</h6>
海洋不再是記憶中或是想像中單純的陽光、沙灘、海水，寄居蟹、螃蟹自然生存其中，一幕幕垃圾覆蓋沙灘的景象取代自然海景，成為我們這代與下一代的「習以為常」。
可能是自發行動，或是被學校要求、被公司安排或是被父母親友邀請而來，淨灘在這幾年熱門了起來。其實，至少在20年前，台灣就開始出現淨灘行動，當年被父母帶來淨灘的幼童，至今已經成了青年。根據環保署統計，2017年4月至2018年11月間，全國淨灘場次達2萬3469場次，淨灘人數約40萬人次，淨灘已不再是陌生的環境守護行動。而除了少數的「內地」，全台灣幾乎沒有撿不到海洋廢棄物的縣市。
到海灘撿垃圾，究竟有什麼用？淨灘淨了這麼久，到底淨出什麼成果？從有廢棄物監測紀錄的2010年開始細數，可以發現塑膠製品的數量連年蟬聯寶座，其中又以塑膠袋、寶特瓶、塑膠瓶蓋與吸管居多。

<h6 style="font-weight:bold;">相關安全守則</h6>
1. 首先，注意淨灘範圍的地形地貌，專注行走，以避免可能因環境不同而產生的拐傷、滑倒等風險。
2. 海灘廢棄物大致停留在潮線上或是後方防風林處，清除時也可以此區域為優先，但切勿太過靠近海面，同時勿追逐海面上廢棄物。
3. 如位處離海水較近或海浪可觸及的區域，請保持面向海面，並隨時注意海浪狀況，以保留充足的反應時間。
4. 避免徒手撿拾廢棄物，更應避免將手伸到看不淸楚的 位置撈廢棄物、或大動作用手狂掃、狂抓廢棄物。
5. 隨時注意腳下、周遭的環境，避免踩踏或碰觸到生物及危險物品。
6. 隨時注意天氣變化，如果聽到雷聲，應盡速離開沙灘、空曠地區，移動時也優先離開海水可觸及、或已潮濕的海灘範圍。', 'img/activity/clean_beach01.jpg', 2, 50, 5, 2, 1, '萬里野柳', 25.2040727, 121.6854615,1,'室外'),
	--'淨灘','野柳','環境保護',null ,null),
	('淨街 GO CATCHING', '2020/07/08', '2020/10/14 09:00', '2020/10/14 13:00', 17, '每天經過的街道，每日來回的風景，你發現了嗎？時有不經意的垃圾走失，
	讓環境失去笑顏，所以快行動吧！我們一起淨街，讓環保從日常生活做起，重新看到自然的美麗！', 'img/activity/clean_street01.jpg', 2, 30, 5, 2, 2, '台北', 25.0245467, 121.5271773,null,'室外'),
	--'淨街','師大夜市','環境保護','就缺你一個',null),
	('夜宿屏東海生館', '2020/08/30', '2020/10/16 18:30', '2020/10/17 18:00', 20, '夜宿海生館並非單純在展缸旁就寢的活動；在正式就寢之前，將由專業的解說人員全程帶領，深入瞭解海生館的點點滴滴。於導覽中認識海洋生態及大眾眼中的海生館；至後場參觀魚缸上方的飼育區，認識飼育員的工作內容及環境，並親自餵食海洋生物；時至夜幕低垂，將再次進入展區，於夜間探索海洋生物們的夜生活。各項活動皆是為夜宿來賓專屬設置，包含了戶外潮間帶生態觀察、特別加演的大洋池餵食，以及海洋生態課程等等，都是您專屬的體驗內容。【夜宿體驗】夜宿海生館活動為兩天一夜的生態體驗遊程，全程包括了海生館兩日入館參觀體驗、六項夜宿海生館體驗遊程、餐食服務將提供當天晚餐、宵夜、次日早餐，以及依所選場域與海洋生物共眠。提醒您:海生館配合中央防疫政策即日(8/23)起將強制落實口罩佩戴事宜，無佩戴者不開放入館！',
		'img/activity/01.jpg', 3, 10, null, 1, 1, '屏東', 22.046296, 120.698884,null,'室內'),
	--'海生館','海洋','夜宿'）
	('金色水岸單車遊', '2020/09/08', '2020/09/27 08:00', '2020/09/27 18:00', 23, '金色水岸自行車行！因為淡水河面映著夕陽所反射出的金色柔柔波光，因此這條自行車道被取名為「金色水岸自行車道」，沿線美麗的風景與知名的觀光景點，使其美名不脛而走。單車遊客能飽覽淡水的人文與自然景觀，路況多屬平坦路段、騎乘時舒適度佳，適合一般大眾攜家帶眷在此騎車及紓解壓力，部分路段樹蔭與遮蔽物較少，提醒單車遊客一定要做好防曬的準備。關渡站 、竹圍站 、紅樹林站都開放非摺疊式自行車進出，自己帶單車的遊客記得從這幾個捷運站出入喔。' ,
		'img/activity/02.jpg', 3, null, null, 1, 1, '淡水', 25.169239, 121.441418,null,'室外'),
	--'鐵馬','紅樹林')
	('一起油畫與二手畫具交易', '2020/09/01', '2020/09/30 14:00', '2020/09/30 18:00', 19, '一起畫畫吧！自帶畫筆與顏料，可順便交易二手的寶貝們唷！',
		'img/activity/03.jpg', 4, 10, null, 1, 1, '台北', 25.048008, 121.520018,null,'室外'),
	--'二手換物','油畫')
	('攝影聚會與鏡頭交易＿大稻埕', '2020/09/02', '2020/10/01 07:30', '2020/10/01 15:00', 16, '歡迎攝影愛好者！活動當天以大稻埕街景為主題拍照交流,拍照結束後有交流時間可以互相買賣鏡頭及相機相關產品',
		'img/activity/04.jpg', 4, null, null, 1, 1, '台北', 25.059670, 121.513308,null,'室外'),
	--'攝影','鏡頭','二手')
	('珊瑚礁體檢志工招募', '2020/08/30', '2020/10/23 10:30', '2020/10/23 17:00', 18, '夯潛水的你，歡迎加入珊瑚礁體檢志工讓潛水活動成為愛海洋的力量，更接近、更了解水下世界的美麗和窘境。希望透過珊瑚礁體檢數據和行動讓社會大眾更加認識平常看不見的海底珊瑚世界及其存在的重要性！',
		'img/activity/05.jpg', 1, 2, null, 2, 1, '基隆', 25.151071, 121.801049,null,'室外'),
	--'珊瑚礁','海洋關懷')
	('老樹體檢志工', '2020/09/09', '2020/10/30 08:30', '2020/10/30 17:30', 18, '老樹志工的服務主要是觀察台南市列管在案的老樹狀態。列管的老樹由志工去認養。老樹有每月健檢表，志工們定期觀察後傳到農業局，通報樹的狀況。像颱風來了，樹木斷枝或連根拔起，就要通報。',
		'img/activity/06.jpg', 1, 10, null, 2, 1, '台南', 23.009596, 120.226742,null,'室外'),
	--'老樹','體檢'）
	('線上Python初學者交流', '2020/07/30', '2020/08/29 10:00', '2020/08/29 13:30', 20, '如果對投資深感興趣、想實際操作如何使用Python爬取歷年股價資訊，歡迎來小聚和我們交流唷！',
		'img/activity/07.jpg', 6, null, null, 1, 3, '線上活動', null, null,null,'室內'),
	--'Python','工程師'）

	('創意手作乾燥花體驗', '2020/08/06', '2020/09/29 14:00', '2020/09/29 18:00', 19, '幸福的真正秘密，就在於，對於日常生活的所有細節抱著純粹的興趣。- William Morris 威廉莫里斯 今天你想怎樣度過呢？你的日常又充滿著什麼樣的細節呢？讓我們放下平日的繁瑣體驗一花一草的細膩美好吧',
		'img/activity/08.jpg', 0, null, 10, 1, 3, '台北', 25.034404, 121.565000,null,'室內'),
	('不限主題讀書會', '2020/08/15', '2020/08/30 10:00', '2020/08/30 15:30', 20, 'Hi～大家好，近日我與我朋友KC想發起一個讀書會，用意是希望生活忙碌之餘，能撥些時間讀讀書充實自己，並且找些同樣喜愛閱讀的朋友，在讀完書後能聊聊彼此的體會與想法，我相信除了書上的知識外，與朋友交流各自的見解，聽聽別人的想法也是很有幫助的！下面我想先寫出讀書會大致進行方式，讓有興趣的朋友能先了解我們的想法，並且思考是否符合自己的閱讀習慣與期望，若是加入後才發現水土不服，無法充分在讀書會中享受閱讀與分享的樂趣，那就非我們所願了。以下是KC先擬出的大致進行方式，也很符合我的想法：【讀書會組成】1.成員暫定為6人2.可組成Line群組或臉書社團，平常線上可以交流討論or聊天打屁3.每次讀書會中有4種角色：帶領者、場地者、紀錄者、參與者帶領者需要在當月的讀書會舉辦日期，最晚三周前，提供3~5本的推薦書籍，供大家票選當月要看哪本，並且在讀書會進行時，開頭先分享當月書籍的精華與重點，準備一些問題引導大家討論，也要把讀書會控制在2~3小時左右的時間，所以帶領者可說是當月的核心人物。場地者負責當天的場地預約，以及現場向大家收錢。紀錄者負責簡單記錄討論內容，並整理在讀書會線上群組，用意是希望日後還可以回顧這些討論。參與者當天準時參與活動即可。【地點】以台北、新北，適合久坐討論的場地為主。【進行方式】1.半年為一次循環，每個月舉辦一次，也就是每個月會讀一本書2.每個人在半年內，至少都需當過一次帶領者、紀錄者、場地者3.讀書會當天會定出下次的進行時間，若無重要因素盡量別更改日期，無故缺席2次者不得再參與活動，主要是希望能維持讀書會定期的舉辦與討論品質讀書會前由帶領者於最晚三周前，提供3~5本書籍，給大家票選當月要看哪本，場地者負責搞定場地。讀書會中帶領者引導大家討論，並控制時間在2~3小時內，全員分享自己在書中得到的啟發或體會，並在最後選出下一個月的各角色人選，以及讀書會日期，也可自願。讀書會後由紀錄者整理討論內容，並在一周內把紀錄更新到讀書會的Google表單。也鼓勵全員能在會後寫下心得，也分享到Google表單。【主題】推薦書籍的主題不拘，原意是希望能讓成員接觸不同領域的書籍，而且各成員也可能會有自己偏好或擅長的書本類型，希望能彼此交流學習，唯一較需要留意的是，希望選書內容是適合討論的，讀書會進行也能比較順暢。進行方式大致就是這樣了，除了有些基本的規範，維持讀書會進行的品質外，其他部分大概都不用太拘謹，我跟KC都算是隨興的人，只希望成員們都能在讀書會中，因為讀到不同的好書而感動，並且享受與人分享交流的樂趣，有些細節沒說清楚或有疑慮都可以再討論，總之有興趣的朋友歡迎來信聊聊啊！',
		'img/activity/09.jpg', 0, null, null, 0, 1, '台北', 25.037991, 121.515969,null,'室內'),
	('南寮秋季淨灘', '2020/08/25', '2020/10/11 09:30', '2020/10/11 15:30', 22, '熱愛大海的你，享受著海洋給予的美好，戲水、浮潛、衝浪、風帆、海鮮、慢步在細軟的沙灘，每一段與海洋的記憶，都豐富著我們的生活與生命。相信愛海的你，必定希望能永遠享有這樣的美景。在海邊遊玩的同時，不只帶走自己的垃圾，並舉手之勞撿起沙灘上的垃圾。對旅客而言也許只是小小的一公斤，而對荒野與海洋來說，卻是個重要行動與監測數據。現在邀請你到海邊遊玩時，跟著荒野愛海三步驟，讓旅行更具意義！',
		'img/activity/10.jpg', 2, null, null, 4, 1, '新竹', 24.856037, 120.929003,null,'室外'),
	('花蓮七星潭淨灘', '2020/09/01', '2020/10/20 09:30', '2020/10/22 15:30', 22, '「只要親自淨灘過一次，就能了解拋棄式塑膠的恐怖。」這是大多數人參與過淨灘活動後的感想。臺灣是海島國家，卻從來只養成海鮮文化，就算幾乎每個縣市都與海比鄰，與「海洋」的距離卻非常遙遠。',
		'img/activity/11.jpg', 2, null, null, 4, 1, '新竹', 24.046117, 121.623549,null,'室外'),
	('大安森林公園workout together', '2020/01/15', '2020/10/05 19:30', '2020/10/05 22:00', 18, '各種不同的訓練方式都來交流吧！',
		'img/activity/12.jpg', 5, null, null, 1, 4, '台北' , 25.032551, 121.534899,null,'室外'),
	('一起爬象山！', '2020/07/10', '2020/10/27 07:30', '2020/10/27 15:30', 17, '大家一起來去爬象山吧！！！！',
		'img/activity/13.jpg', 5, null, null, 1, 1, '台北',  25.028622, 121.576542,null,'室外'),
	('大佳河濱公園夜跑', '2020/08/05', '2020/10/15 19:30', '2020/10/15 22:00', 19, '炎熱的夏天讓我們一起享受在在黑暗中的河濱微風吧！',
		'img/activity/14.jpg', 5, null, null, 1, 2, '台北', 25.074863, 121.541217,null,'室外'),
	('烏石港沙灘排球！', '2020/08/10', '2020/10/29 08:30', '2020/10/29 11:30', 23, '不論技巧好壞都歡迎來參加唷！',
		'img/activity/15.jpg', 5, 15, null,  1, 1, '宜蘭', 24.878370, 121.843136,null,'室外'),

	('東方環頸鴴在哪兒?八里水岸賞鳥', '2020/08/10', '2020/10/10 06:00', '2020/10/10 12:00' , 3, '【新北八里】挖子尾自然保留區。來看彈塗魚、招潮蟹！來一趟大自然生態教室之旅',
		'img/activity/rra01.jpg', 3, 50, null, 2, 1, '新北', 25.163568, 121.421507,null,'室外'),
	('城市獵人-大安森林公園生態觀察', '2020/03/09', '2020/10/09 06:00', '2020/10/09 12:00' , 3, '在擁擠、嚴重污染及「熱島效應」帶來高溫的台北市，26公頃純休閒性「都市森林」型態的公園，無異是清新的「都市之肺」，可以滌塵淨化空氣、降低噪音、調節氣溫，來園休憩，有花看並可以欣賞音樂台演出，享受「森林浴」舒暢身心，漫步園內，處處美景，可將公園功能發揮盡致。',
		'img/activity/rra02.jpg', 3, null, null, 2, 4, '台北', 25.033258, 121.534233,null,'室外'),
	('台灣大學畢業季，二手物品出清', '2020/05/09', '2020/10/19 10:00', '2020/10/19 20:00', 3, '學弟學妹快來，學長姊的愛都在這裡~',
		'img/activity/rra03.jpg', 4, null, 10, 2, 4, '台北', 25.014975, 121.537008,null,'室外'),
	('師範大學校本部，二手物品出清與交換活動', '2020/05/09', '2020/10/19 10:00', '2020/10/19 20:00', 3, '煩惱畢業了帶不走那麼多東西嗎？沒關係，讓大家幫你分擔。',
		'img/activity/rra04.jpg', 4, null, 10, 2, 4, '台北', 25.025866, 121.527326,null,'室外'),
	('南港行道木健檢志工招募', '2020/01/09', '2020/10/09 13:00', '2020/10/09 16:00' , 3, '南港行道木健檢志工招募，一起關心身旁樹木的健康吧。',
		'img/activity/rra05.jpg', 1, null, null, 1, 4, '台北', 25.055059, 121.608398,null,'室外'),
	('松山行道木健檢志工招募', '2020/01/09', '2020/10/02 13:00', '2020/10/03 16:00' , 3, '松山行道木健檢志工招募，一起關心身旁樹木的健康吧。',
		'img/activity/rra06.jpg', 1, null, null, 1, 4, '台北', 25.059126, 121.562803,null,'室外'),
	('登頂！珠穆朗瑪峰直播', '2020/04/09', '2020/10/17 07:00', '2020/10/17 16:00' , 3, '世界之大，人類是如此苗小。我將帶領大家站上陸地的高點，俯瞰地球之美。',
		'img/activity/rra07.jpg', 6, null, null, 1, 4, '其他', null, null,null,'室內'),
	('台中鳥類攝影展覽', '2020/04/09', '2020/10/11 10:00', '2020/10/20 18:00' , 3, '那一瞬間，被捕捉，成了永恆。',
		'img/activity/rra08.jpg', 0, null, null, 1, 4, '台北', 24.142816, 120.664673,null,'室內'),
	('花蓮鳥類攝影展覽', '2020/03/09', '2020/10/11 10:00', '2020/10/20 18:00' , 3, '時間流竄，本該流逝的美，被囚禁在相片之中。',
		'img/activity/rra09.jpg', 0, null, null, 1, 4, '花蓮', 23.984144, 121.596636,null,'室內'),
	('大安海水浴場淨灘', '2020/07/10', '2020/10/12 07:00', '2020/10/12 17:00' , 3, '海洋人站出來，大家來大安海水浴場淨灘',
		'img/activity/rra10.jpg', 2, null, 10, 2, 1, '台中', 24.378642, 120.583482,null,'室外'),
	('墾丁白沙灣淨灘', '2020/08/15', '2020/10/26 08:00', '2020/10/26 17:00' , 3, '保護海洋，人人有責',
		'img/activity/rra11.jpg', 2, null, 10, 2, 1, '屏東', 21.933730, 120.718790,null,'室外'),
	('基隆河跑友之夜，五月場', '2020/03/10', '2020/11/01 19:00', '2020/11/01 19:00' , 3, '跑友齊聚基隆河，一起感受河濱路跑之美',
		'img/activity/rra12.jpg', 5, null, 5, 1, 4, '台北', 25.058513, 121.601488,null,'室外'),
	('新店溪跑友之夜，六月場', '2020/04/10', '2020/10/16 19:00', '2020/10/16 19:00' , 3, '跑友齊聚新店溪，一起感受河濱路跑之美',
		'img/activity/rra13.jpg', 5, null, 5, 1, 4, '台北', 25.022611, 121.510013,null,'室外'),
	('基隆河跑友之夜，六月場', '2020/04/15', '2020/10/01 19:00', '2020/10/01 19:00' , 3, '跑友齊聚基隆河，一起感受河濱路跑之美',
		'img/activity/rra14.jpg', 5, null, 5, 1, 4, '台北', 25.058513, 121.601488,null,'室外'),
	('基隆河跑友之夜，七月場', '2020/05/10', '2020/10/01 19:00', '2020/10/01 19:00' , 3, '跑友齊聚基隆河，一起感受河濱路跑之美',
		'img/activity/rra15.jpg', 5, null, 5, 1, 4, '台北', 25.058513, 121.601488,null,'室外'),
	 ('響應地球1小時327 一起熄燈愛地球', '2020/10/20', '2020/10/27 19:00', '2020/07/29 20:30', 11, '熄滅大樓外牆及樓頂裝飾或廣告用照明等非必要性燈光',
		'img/activity/161.jpg', 3, null, null, 1, 3, '台北', 25.0568023, 121.5185925,null,'室外'),
    --'環保','救地球')
	('用淨山向山致敬', '2020/06/20', '2020/10/25 10:00', '2020/10/25 17:30', 15, '撿起無法在自然中隨時間分解的人為廢棄物',
		'img/activity/171.jpg', 2, null, null, 1, 3, '台北', 25.194252, 121.5587476,null,'室外'),
	--'環保','救地球','擁抱大自然')
    ('讓海乾淨 向海致敬', '2020/04/10', '2020/10/12 09:00', '2020/10/12 17:30', 18, '還給海洋及海洋生物一個乾淨的生活空間',
		'img/activity/181.jpg', 2, 5, 20, 1, 3, '基隆', 25.2848807, 121.5148355,null,'室外'),
	--'環保','救地球')
	('綠色生活 21 天', '2020/05/08', '2020/10/12 09:00', '2020/10/03 17:30', 8, '連續 21 天，每天一個簡單綠行動，一起在日常生活中做一點小改變，
       也許你會開始習慣，隨時隨地，都對環境再好一點點。','img/activity/19.jpg', 2, 5, 20, 1, 3, '台中', 24.2204731, 120.6756898,null,'室內'),
    ('減廢又減廢', '2020/04/13', '2020/10/15 09:00', '2020/12/31 17:30',6, '以在地廢棄貝殼為原料,推出消毒粉，讓消毒也可以很環保',
		'img/activity/20.jpg', 6, 5, 20, 1, 2, '台灣',0, 0,null,'室內'),
	('響應環保全面行動', '2020/04/10', '2020/09/15 09:00', '2020/09/31 21:30', 2, '台東鹿野的農產品以人力方式，更可以體會到人情味',
		'img/activity/21.jpg', 6, 5, 20, 1, 3, '台灣',0, 0,null,'室外'),
	('曼活優遊里山趣', '2020/06/13', '2020/10/15 09:00', '2020/10/22 17:30',5, '從淺山走進森林，再延伸到天空，介紹臺灣不同樣態棲地的四種代表性野生動物，帶入保育議題及現況，進而介紹民眾日常參與保育的方法，從自身做起，共同為生態保育盡份心力。',
		'img/activity/22.jpg', 3, 5, 15, 1, 3, '台北',25.0278006, 121.5252964,null,'室外'),
	('蛙蛙我罩你生態', '2020/04/22', '2020/12/16 09:00', '2020/10/13 17:30',9, '捲起袖子整理保育類台北赤蛙的家，用行動罩地球！！',
		'img/activity/23.jpg', 3, 5, 15, 1, 3, '新北',25.2643186, 121.5811059,null,'室外'),
	('環島守護保安林', '2020/01/12', '2020/10/16 09:00', '2020/10/18 17:30',13, '一同認識保安林,感受森林帶來的好處,捲袖動手一同守護',
		'img/activity/24.jpg', 1, 5, 15, 1, 3, '新北',24.5663975, 120.4454447,null,'室外'),
	('世界地球日路跑', '2020/02/12', '2020/10/28 06:00', '2020/10/28 12:30',16, '每年四月的世界地球日路跑，結合運動休閒與健康生活，推廣環保愛地球的觀念，讓這份守護地球的理念逐年擴散，大家一起善待我們賴以生存的環境，讓自己、下一代都更健康！',
		'img/activity/25.jpg', 5, null, null, 2, 3, '新北',25.0743433, 121.5371937,null,'室外'),
	('公館二手市集', '2020/07/15', '2020/10/13 08:00', '2020/10/13 17:30',19, '將已完成使命的物品，交接給下一位更需要他的人',
		'img/activity/26.jpg', 4, null, null, 1, 3, '台北',25.0136817, 121.4996768,null,'室外'),
	('城市路跑', '2020/03/15', '2020/10/30 06:00', '2020/10/30 12:30',16, '路跑場地可以欣賞到台北許多不同的美景，沿途可遇見倒映著大直橋的波光粼粼，還能遠眺美麗華摩天輪，甚至可以看到圓山大飯店，讓你遠離生活塵囂走出都會大樓，重新用腳步感受台北不一樣的城市面貌。',
		'img/activity/27.jpg', 5, null, null, 2, 3, '台北',25.0743433, 121.5371937,null,'室外'),
	('2020彰化社頭織足健走，幸福永久', '2020/08/15', '2020/10/17 06:00', '2020-10-17 12:30', 17, '為活絡地方產業與推廣地方文化特色，工業技術研究院織足藏樂館結合經濟部工業局、彰化縣政府、社頭鄉公所及聯結台灣區織襪同業公會、彰化縣織襪產業發展協會、社頭鄉社區發展協會與紡織相關業者，整合社頭鄉在地觀光景點八卦山國家風景區、社頭清水岩寺、生態昆蟲館、農會精品館等，推廣全民運動亦可推廣台灣優良紡織產品，使參與者體驗運動的喜悅與益處，以達活絡產業及推廣地方觀光之目的',
		'img/activity/28.jpg', 5, null, null, 2, 1, '彰化',23.9229489, 120.5799513,null,'室外'),
	('鳳山林園單車遊', '2020/09/20', '2020/10/11 07:00', '2020/10/11 14:00', 17, '使高雄及全國民眾健康優遊高雄好山好水',
		'img/activity/29.jpg', 5, null, null, 2, 1, '高雄',22.6111873, 120.3529409,null,'室外'),
	('西鬧二手市集', '2020/04/15', '2020/11/12 09:00', '2020/11/12 15:00', 20, '將已完成使命的物品，交接給下一位更需要他的人',
		'img/activity/30.jpg', 4, null, null, 1, 3, '台北',25.0439355, 121.503584,null,'室外'),
	('Holiday ya二手市集', '2020/01/15', '2020/11/12 09:00', '2020/12/12 15:00', 15, '將已完成使命的物品，交接給下一位更需要他的人',
		'img/activity/31.jpg', 4, null, null, 1, 2, '台北',25.0452018, 121.5242574,null,'室外'),
		('Holiday ya二手市集', '2020/01/15', '2020/10/12 09:00', '2020/12/12 15:00', 15, '將已完成使命的物品，交接給下一位更需要他的人',
		'img/activity/31.jpg', 4, null, null, 1, 2, '台北',25.0452018, 121.5242574,null,'室外'),
	('雙連埤棲地工作假期', '2020/05/16', '2020/10/16 09:00', '2020/10/16 13:00', 16, '受過傷的雙連埤，需要大家來幫忙復育原來住在這裡的生物的家。
	邀請你一起復原雙連埤的棲息環境， 還她原本眾生快樂的濕地天堂。', 'img/activity/nature01.jpg', 3, 35, 5, 2, 4, '宜蘭縣', 24.749651, 121.638465,null,'室外'),
	--'復育','生態教室','環境保護','就缺你一個',null),
    ('新山夢湖生態導覽', '2020/08/29', '2020/10/07 10:00', '2020/10/07 14:00', 16, '新山夢湖座落於北台灣五指山系東南稜脈群山環抱中海拔325公尺的離塵湖泊，
	常因午後山嵐或雨後水氣而霧起，湖面及周遭群山如夢幻般飄渺，而有「夢湖」的美名。夏季水面如鏡，山林倒影層次分明；冬季雲雨飄渺，波光漣漪共舞，如夢似幻，晶瑩澄澈的湖泊，
	倒映著絢麗的山景，令人佇足忘返。她有一段美麗的歷史以及豐富的生態，湖中悠遊的台灣細鯿更是台灣原生的珍稀物種，撥空來這走走，抱持著歡愉的心與我們一同認識這大自然的餽贈！', 
	'img/activity/nature02.jpg', 3, 25, 7, 1, 1, '新北', 25.1278932, 121.6338507,null,'室外'),
	--'生態導覽','天使秘境','夢湖','周末行程',null),
    ('關渡自然公園志工招募', '2020/07/01', '2020/10/22 09:00', '2020/10/24 17:00', 22, '關渡自然公園長久以來希望從實際體驗及接觸，來讓民眾提高對濕地生態保育的關心。
    透過不同的方式，邀請對自然環境有興趣，且也願意學習服務的你，一同加入我們的行列。', 'img/activity/park_volunteer.jpg', 1, 15, 2, 2, 1, '台北', 25.1188937, 121.4686446,null,'室外'),
	--'關渡','自然生態','志工','認識自己的城市',null),
    ('2020綠色生活', '2020/07/27', '2020/10/16 00:00', '2020/10/18 24:00', 30, '今年，誠摯邀請你一起展開 21 天的綠行動旅程、養成綠色習慣，為氣候帶來可能的改變，
	而「宣告」，就是今年的第一個動作。', 'img/activity/greenlife21.jpg', 6, null, null, 1, 4, '其他', null, null,null,'室內'),
	--'綠色生活','習慣成自然','環境保護','就缺你一個',null),
    ('瓶罐再利用工作坊', '2020/09/14', '2020/10/30 14:00', '2020/10/30 17:00', 30, '回收再利用絕對是一件很酷的事情，尤其當你把別人不要的垃圾變成全新而有用的東西時，
	絕對會讓你感到非常有成就。當然，已經有很多人在回收利用這方面做了很多事情，本次工作坊將示範許多好用的回收改造妙計，歡迎一起動手做做看唷！', 'img/activity/recycle_act01.jpg',
	0, 30, 5, 1, 1, '台北', 25.0502698, 121.5495207,null,'室外'),
	--'回收再利用','綠色生活','環境保護',null ,null),
    ('愛護地球手作環保套組', '2020/08/11', '2020/10/29 13:00', '2020/10/29 16:00', 30, '有些衣服已經很少穿了卻捨不得丟？一起來延續它們的生命，換一個模樣陪伴在你身旁吧！
	盲目地購買環保產品其實也是一種不環保的行為，讓我們一起利用現有的資源，製作出需要的環保套組吧！', 'img/activity/handmade01.jpg', 0, 25, 5, 2, 4, '台北', 25.0339497, 121.5478402,null,'室外'),
	--'手作','親子','綠色生活','環保',null),
    ('不塑路跑', '2020/09/09', '2020/10/03 09:00', '2020/10/03 17:00', 23, '「不塑路跑」是六都第二個以減塑為目標的路跑賽事，預計可以減少1萬個一次性使用水杯，
	跑者全程可在補給站以及主辦會場使用循環環保杯「新北Ucup」，杯身標示「使用後請歸回」，提醒民眾現場回收環保杯以利重複使用。', 'img/activity/run01.jpg', 5, 300, 80, 1, 1, '新北', 25.2231771, 121.6370557,null,'室外'),
	--'路跑','運動顧環保','環境保護',null,null),
    ('RUN FOR THE OCEANS 為海開跑', '2020/09/01', '2020/10/01 07:00', '2020/10/01 13:00', 21, '一起在福隆海水浴場為海開跑! 用5K路跑，一起為海洋保育盡一份心力! 
	每跑1公里，adidas捐1美金。現場還可以體驗Live DJ Workout Party、海洋動物流瑜珈，還可以體驗藍染和Henna人體彩繪喔！', 'img/activity/runforocean.jpg', 5, 800, null, 1, 1, '新北', 25.0316271,121.9281857,null,'室外'),
	--'路跑','海洋','環境保護',null,null),
    ('Plogging河濱樂跑團', '2020/09/03', '2020/10/07 19:00', '2020/10/07 21:00', 24, '慢跑結合環保理念，以邊跑邊走邊撿垃圾的生活態度，穿梭大街小巷，在城市漫步的同時，讓城市保持最乾淨美麗的面貌。
	慢跑中蹲下撿瓶罐等垃圾時的深蹲動作，還能加強健核心肌群，甚至跳起來撿樹上的垃圾，也是種很好的伸展運動，歡迎大家一起來參加唷！', 'img/activity/plogging02.jpg', 5, 30, 2, 1, 2, '台北', 25.0748199, 121.5605066,null,'室外');
	--'plogging','運動顧環保','環境保護','就缺你一個',null),

	-- 活動標籤
insert into Activity.tActivityLabel
	(fLabelName)
values
	('#潛水'),('#世界地球日'),('#淨街'),('#環保'),('#阿里山'),('#雲端'),('#2020'),('#路跑'),('#停一下往山林'),('#斯巴達'),
	('#金山'),('#淨海'),('#一件好事'),('#Discovery'),('#衫林溪'),('#擁抱大自然'),('#貓咪照顧'),
	('#關懷流浪動物'),('#銀髮族'),('#公館'),
	('#跳蚤市集'),('#舊衣'),('#寵物音樂會'),('#假新聞'),('#名家系列'),('#偏鄉教育'),('#研習營'),('#教育'),('#共勉之'),('#浪浪'),
	('#義賣'),('#領養代替購買'),('#刺青'),('#剪髮'),('#瑜珈'),('#公益') ,('#初學者友善'),('#周末活動'),('#古物'),('#野柳'),
	('#環境保護'),('#師大夜市'),('#就缺你一個'),
	('#海生館'),('#海洋'),('#夜宿'),('#鐵馬'),('#紅樹林'),('#二手換物'),('#油畫'),
	('#攝影'),('#鏡頭'),('#二手'),('#珊瑚礁'),('#海洋關懷'),('#老樹'),('#體檢'),
	('#Python'),('#工程師'),('#復育'),('#生態教室'),('#生態導覽'),('#天使秘境'),
	('#夢湖'),('#關渡'),('#自然生態'),('#志工'),
	('#認識自己的城市'),('#綠色生活'),('#習慣成自然'),('#回收再利用'),
	('#手作'),('#親子'),	('#運動顧環保'),('#plogging'),
	('#守護海洋'),('#海洋垃圾'),('#培訓'),('#挖寶趣'),('#斷捨離'),
	('#障礙賽'),('#普悠瑪'),('#鐵人三項'),('#黃明志'),('#虛擬演唱會'),('#AR'),('#好想出去走'),('#高雄'),('#淨灘'),('#健行');
	     

-- 活動 Had 標籤
insert into Activity.tActivityHadLabel(fActivityId,fActivityLabelId)
values (1,8),(1,2),(1,43),
       (2,76),(2,2),
       (3,76),(3,2),
       (4,1),(4,4),(4,77),(4,78),
       (5,68),
       (6,89),
       (7,49),(7,21),(7,80),
	   (8,62),(8,60),
	   (9,61),(9,62),(9,9),(9,90),
	   (10,38),(10,71),(10,79),(10,43),(10,21),	   
       (19,5),(19,6),(19,7),(19,8),(19,38),
	   (44,8),(46,8),(81,8),(108,8),
	   (53,7),(53,89),(53,76),(53,43),
	   (25,89),
	   (87,89),
	   (24,89),
	   (80,89);
	   

-- 活動參與者

insert into Activity.tJoinList(fActivityId, fMemberId, fJoinTime, fJoinTypeId)
			--JoinType 發起6,參加2
values (1,9,'2020-08-01',6),(1,13,'2020-08-03',2),(1,20,'2020-08-03',2),(1,11,'2020-08-03',2),(1,26,'2020-08-03',2),(1,35,'2020-08-03',2),(1,27,'2020-08-03',2),
       (2,5,'2020-08-03',6),(2,38,'2020-08-03',2),(2,22,'2020-08-03',2),(2,25,'2020-08-03',2),(2,33,'2020-08-03',2),(2,28,'2020-08-03',2),
	   (3,8,'2020-08-03',6),(3,34,'2020-08-03',2),(3,23,'2020-08-03',2),(3,26,'2020-08-03',2),
	   (4,10,'2020-08-03',6),(4,17,'2020-08-03',2),(4,19,'2020-08-03',2),(4,24,'2020-08-03',2),
	   (5,11,'2020-08-03',6),(5,3,'2020-08-03',2),(5,13,'2020-08-03',2),(5,12,'2020-08-03',2),
       (6,4,'2020-06-12',6),(6,6,'2020-06-12',2),(6,20,'2020-06-12',2),(6,16,'2020-06-12',2),
	   (7,4,'2020-09-07',6),
	   (19,15,'2020-08-05',6),(19,10,'2020-08-05',2),(19,12,'2020-08-05',2),(19,11,'2020-08-05',2),
	   (41,31,'2020-08-03',6),(41,19,'2020-08-03',2),(41,18,'2020-08-03',2),(41,17,'2020-08-03',2),
	   (44,13,'2020-08-03',6),(44,20,'2020-08-03',2),(44,26,'2020-08-03',2),(44,28,'2020-08-03',2),
	   (53,29,'2020-08-05',6),(53,8,'2020-08-05',2),(53,15,'2020-08-05',2),(53,26,'2020-08-05',2),(53,23,'2020-08-05',2),(53,20,'2020-08-05',2),
	   (53,4,'2020-08-05',2),(59,6,'2020-08-05',2),
	   (79,23,'2020-08-05',6),(79,6,'2020-08-05',2),
	   --感興趣---(fActivityId, fMemberId, fJoinTime, fJoinTypeId),感興趣0-----------
	   (59,6,'2020-08-05',0),(79,6,'2020-08-05',0),(44,6,'2020-08-03',0),(41,6,'2020-08-03',0),(4,6,'2020-08-03',0),(3,6,'2020-08-03',0),
	   (1,27,'2020-09-18',0),(1,13,'2020-08-03',0),(1,20,'2020-08-03',0),(1,11,'2020-08-03',0),(1,26,'2020-08-03',0),
	   (20,3,'2020-09-18',0),(24,3,'2020-09-21',0),(44,3,'2020-09-21',0),(80,3,'2020-09-21',0),(88,3,'2020-09-21',0),(37,3,'2020-09-11',0),
	   
	   ----過往活動100,81,92,91,82,23,86,78,76,3,85
	   (85,3,'2020-05-25',2),(100,23,'2020-05-25',2),(81,3,'2020-05-25',2),(86,3,'2020-05-25',2),(82,3,'2020-05-25',2)
	   ,(85,6,'2020-05-25',2),(23,6,'2020-05-25',2),(82,6,'2020-05-25',2),(78,6,'2020-05-25',2);




---------------------------------------------------------------------------------------
insert into sMessage.tMessage
	(fMemberId,fContent)
VALUES(1, '成功加入社團'),
	(1, '已加入活動'),
	(2, '成功加入社團'),
	(4, '活動人數不足,活動未成立'),
	(3, '成功加入社團'),
	(5, '等待審核請稍後~')
---------------------------------------------------------------------------------------
insert into Activity.tJoinList
		(fActivityId,fMemberId,fJoinTime,fJoinTypeId)
values(3,2,'1992/05/08',3),(3,15,'1990/07/08',2),(3,2,'1995/06/23',3)

----瀏覽過資料-----------------------------------------------------------------------------------------
insert into Activity.tSearchList(fActivityId,fMemberId,fSearchTime)

values(2,3,'2020/08/24 13:15:25'),(2,5,'2019/07/29 14:18:28'),(2,6,'2020/08/24 19:29:30')

insert into Activity.tSearchList(fActivityId,fMemberId,fSearchTime)

values(4,3,'2020/08/20 13:15:25'),(5,5,'2019/07/27 14:18:28'),(9,6,'2020/08/25 19:29:30')






-- chat ------------------------
INSERT INTO Chat.tChatroom (fMemberId1, fMemberId2, fLastDataId) 
Values  (3, 4, 4),(3, 6, 8),
        (3, 34, null),(3, 35, null),(3, 36, null),(3, 37, null),(3, 38, null),
        (3, 24, null),(3, 25, null),(3, 26, null),(3, 27, null),(3, 28, null),
		(3, 14, null),(3, 15, null),(3, 16, null),(3, 17, null),
		(6, 34, null),(6, 35, null),(6, 36, null),
		(5, 15, null),(5, 16, null),(5, 17, null);

INSERT INTO Chat.tChatData(fChatRoomId, fTime, fMemberId, fContent) 
Values  (1, '2020/9/11 下午12:20',3 ,'你好'),
 (1, '2020/9/11 下午12:25', 4,'嗨，什麼事?'), (1, '2020/9/11 下午12:28', 3,'我想加入環境保育社團'), (1, '2020/9/11 下午12:30', 3,'可以嗎?'),
 (2, '2020/9/12 下午12:25', 3, '要加入原生植物社團嗎?'), (2, '2020/9/12 下午12:27', 6,'我想想'),(2, '2020/9/13 下午12:30', 3,'決定好了嗎?'), (2, '2020/9/13 下午12:30',6,'++'),(2, '2020/9/15 下午12:35',3,'沒問題'),
 (7, '2020/9/12 下午12:35',38,'Hi~'),
 (10, '2020/9/12 下午12:35',3,'Hi~'),
 (12, '2020/9/12 下午12:35',28,'Hi~');

  

  UPDATE Chat.tChatroom 
  SET fLastDataId = 4  --更改欄位
  WHERE fId = 1    
  
  UPDATE Chat.tChatroom 
  SET fLastDataId = 9  --更改欄位
  WHERE fId = 2  


    UPDATE Chat.tChatroom 
  SET fLastDataId = 10  --更改欄位
  WHERE fId = 7  


    UPDATE Chat.tChatroom 
  SET fLastDataId = 11  --更改欄位
  WHERE fId = 10
  
    UPDATE Chat.tChatroom 
  SET fLastDataId = 12  --更改欄位
  WHERE fId = 12